[
  {
    "courseId": "015698",
    "courseOfferNumber": 1,
    "termCode": "1255",
    "termName": "Spring 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "GEOG",
    "subjectCode": "GEMCC",
    "catalogNumber": "650",
    "title": "Business and Climate Change",
    "descriptionAbbreviated": "Business and Climate Change",
    "description": "This course examines the intersection of business management, climate change, and the evolving policy environment within which mitigation and adaptation occurs. A Canadian lens is applied to understanding: climate change business economics; the changing policy and regulatory landscape at the international, national and provincial levels; the ways in which a price on carbon and the need to disclose carbon and climate risk can affect business decision-making; and various opportunities for companies to reduce their carbon footprint to operate in emerging low-carbon economies, make their business more resilient to the impacts of climate change, and identify value-creation opportunities. Leadership cases from businesses worldwide will be explored, including multi-nationals and small and medium sized enterprises.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "015860",
    "courseOfferNumber": 1,
    "termCode": "1255",
    "termName": "Spring 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "GEOG",
    "subjectCode": "GEMCC",
    "catalogNumber": "644",
    "title": "Climate Resilient Canadians and Health Systems",
    "descriptionAbbreviated": "Climate Rslnt Cdns Hlth Systms",
    "description": "Climate change is a growing threat to the health of Canadians, their communities and health systems. Over two decades of increasing research, partnerships, awareness building and adaptation development among health authorities has demonstrated that significant opportunities exist to make strides in efforts to protect Canadians from current and future impacts. This course examines climate-change related health risks to Canadians, including to populations of highest concern - seniors, young children, people with chronic illnesses, the socially and economically disadvantaged, and Indigenous Populations - and the potential for impacts on communities and health systems. New tools such as climate change and health vulnerability and adaptation assessments and health system stress testing are discussed along with their application to policy and program development by Canadian and international partners. Guest lectures and case studies are used to illustrate and learn from the actions of leading health adaptors in efforts being taken to prepare people for the future climate.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Antireq: GEOG 675 Tpc 223 and GEOG 694 Tpc 2"
  }
]