[
  {
    "courseId": "010292",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ACC",
    "subjectCode": "TAX",
    "catalogNumber": "625",
    "title": "Tax Policy",
    "descriptionAbbreviated": "Tax Policy",
    "description": "This course investigates the Canadian tax system in light of the objectives of that system.  For any current tax rule, the idea is to identify the underlying policy problem the rule is intended to solve, consider alternative solutions, and then determine if the current tax rule can be improved.  Students will apply this procedure in a major essay.  In class, topics discussed will include: the process of formulating tax policy and the roles of Finance; CCRA; courts, lobby groups, etc.; the goals of taxation such as fairness and neutrality; tax evasion and the underground economy; flat taxes and single-rate taxes versus progressive-rate taxes; and implementing incentives through the tax system versus as direct government expenditures.  This course is intended to make students think about the purpose of tax rules.  Tax rules are just so many random bits of information unless you understand the purpose of the rules.  Understanding the purpose helps you remember the rules and makes you better able to explain them to clients.  Also, by identifying gaps and inconsistencies where the rules do not achieve their purpose, you may be able to identify tax planning opportunities and areas where the rules may change in the future.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "010295",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ACC",
    "subjectCode": "TAX",
    "catalogNumber": "627",
    "title": "International Tax I",
    "descriptionAbbreviated": "International Tax I",
    "description": "Barriers to cross border trade and investment continue to come down.  At the same time, technology has enabled business organizations to access markets that were previously out of reach and to develop new business models that improve the profitability of their operations.  The business operations for companies of all sizes are increasingly global.  International tax plays a significant role in shaping the manner in which multi-national enterprises organize and finance their operations.  The practice of international tax provides an exciting opportunity to actively participated in the fast changing world of global commerce alongside a multi-disciplinary team of other professionals and business leaders.  The International Tax I Course is designed to provide an introduction to Canada's international tax rules and tax treaties.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "010296",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ACC",
    "subjectCode": "TAX",
    "catalogNumber": "628",
    "title": "Tax Planning for the Owner-Manager and Executive",
    "descriptionAbbreviated": "Tax Plan for Owner-Mgr & Exec",
    "description": "Owner-Managers usually have dynamic tax circumstances which demand that the tax advisor adapt their thinking quickly and effectively.  Owner-Managers also require their advisors to bring significant value to their businesses and often look for instant gratification.  This course is designed with this in mind.  Students will learn the tools required to bring value to their clients through practical application.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "012180",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ACC",
    "subjectCode": "TAX",
    "catalogNumber": "629",
    "title": "Tax Risk Management",
    "descriptionAbbreviated": "Tax Risk Management",
    "description": "This course investigates tax and related accounting issues found in the tax provision on the financial statements to deepen the understanding of the impact of tax on accounting.  It will also address the identification, measurement and reporting of tax risk.  Cases are used to highlight the interaction between the income Tax Act and the CICA Handbook.  Corporate governance issued involved in the tax provision will overlay this course.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]