[
  {
    "courseId": "016495",
    "courseOfferNumber": 1,
    "termCode": "1239",
    "termName": "Fall 2023",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "218",
    "title": "Sexual Health and Well-being in Comics",
    "descriptionAbbreviated": "Sex Hlth, Well-being in Comics",
    "description": "This course will present a concentrated history of the major trends and patterns within the representation of human sexuality and sexual health in 20th- and 21st-century comics art. Students will be introduced to the unique and powerful role that comics have played in representing sexuality and sexual well-being through exposure to various artists and scholars on the subject. Students will explore key concepts through close readings of relevant texts, and through the application of key theoretical materials, modeling the kind of analytical work that students will then produce themselves in both discussion and written assignments.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Antireq: SMF 200 taken spring 2020"
  },
  {
    "courseId": "016503",
    "courseOfferNumber": 1,
    "termCode": "1239",
    "termName": "Fall 2023",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "312",
    "title": "Cross-Cultural Care Traditions",
    "descriptionAbbreviated": "Cross-Cultural Care Traditions",
    "description": "This course will examine the close relationship between cultural plurality and health. Students will explore how attitudes toward health and understandings of illness are influenced and understood by different cultures. Although the course will be grounded in literary texts, it will be supplemented by material from a range of other disciplines. Students will engage issues as varied as the ethics of caring for and being cared by culturally diverse people, non-Western forms of care including Indigenous care, differing perceptions and rules for living (and dying), different attitudes toward medical treatment, and diverse spiritualities. Selected cultural traditions will be studied.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]