[
  {
    "courseId": "016493",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "101",
    "title": "Foundations of Health Humanities",
    "descriptionAbbreviated": "Health Humanities Foundations",
    "description": "Students will learn how diverse humanities disciplines (literature, history, philosophy, and others) contribute to a rich and well-rounded understanding of human health. Through a study of selected moments, concepts, and texts, students will engage with significant representations of health, illness, medicine, and the body from different eras and cultures. Students will have the opportunity to exercise self-awareness and sensitivity to the experience of others and to form skills in text-centred analysis, critical reflection, and careful argumentation.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016497",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "222",
    "title": "Health, Illness, and Narrative",
    "descriptionAbbreviated": "Health, Illness & Narrative",
    "description": "What stories do we tell ourselves about our bodies, relationships, and lives as we try - individually and as a culture - to be \"healthy\"? And how do stories help us cope with the uncertain, often scary, and sometimes tragic scenarios when illness replaces health? In this course students will pursue these questions by exploring the role narrative plays in our broader perceptions of health and illness. Through discussion and writing, students will analyze a range of media and genres to gain insight into the larger cultural discourses and social institutions that shape our understanding of these topics.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016498",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "263",
    "title": "Contagion, Disease, and Illness in Italian Literature and Film",
    "descriptionAbbreviated": "Contagion, Disease & Illness",
    "description": "This course will focus on representations of contagion and illness in Italian literature and film. Covering such topics as the portrayal of the Bubonic Plague in 14th-century novelle, Renaissance descriptions of syphilis, Verist and Neo-realist stories about contagion and poverty, and the projection of social malaise in art films, students will assess the ways in which disease is depicted in primary texts. Students will gain familiarity with contemporary contagion theories, as well as historicization and cultural criticism of literary and cinematic accounts of disease. In this course students will consider the psycho-social impact of contagion and disease from multiple perspectives - near and far, past, and present.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016499",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "288",
    "title": "Health, Medicine, and Spirituality",
    "descriptionAbbreviated": "Health, Medicine, Spirituality",
    "description": "This course examines how spirituality and religion have informed approaches to health and medicine from the 19th century to the present, including understandings of disease, illness, health, sexuality, and the body. Topics may include spiritual and/or religious concepts of health and sickness; meditation, prayer, and healing; \"alternative\" medicine; Indigenous approaches to health and medicine; mental health and spiritual practice; and religion and health care justice. Students are introduced to a variety of research methods that will help them identify, understand, and critically assess the complex boundaries that exist between modern medicine and spirituality.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016502",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "311",
    "title": "Culture, Mental Health, and Wellness",
    "descriptionAbbreviated": "Culture, Mental Hlth, Wellness",
    "description": "This course investigates the objective and subjective realms of mental well-being, ill-being, and illness across diverse societies and cultures, as expressed through literature, film, and other media. Students will investigate the theories and methodologies employed in humanities-based mental health research; understand bibliotherapy both developmentally and therapeutically; and evaluate how texts, images, and performances shape different perspectives of mental illness and mental health. To enhance awareness of subjective aspects of human nature and prejudices, and to appreciate arts-based mental health research, students will engage in experiential learning with a rich-pictures exercise and reflective practice.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]