[
  {
    "courseId": "016494",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "241",
    "title": "Caregiving, Illness, and Relationships",
    "descriptionAbbreviated": "Caregiving, Illness & Rel",
    "description": "In the typical health care model most of the attention is focused on the patient and their well-being, often ignoring the health, financial, and emotional impact on those who provide unpaid informal care and support - family and friends. Through the reading of memoirs, students with an interest in aging, health care, and the therapeutic professions will grapple with the profound impact that caregiving during illness has on carers and relationships across the spectrum - from young carers, to intimate partners, to adult children caring for aging parents, and beyond. Discussions will be grounded in the social, legal, and policy contexts.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016501",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "307",
    "title": "Concepts of Health and Disease in Western Medical History",
    "descriptionAbbreviated": "Hlth & Disease West Med Hist",
    "description": "This course introduces students to three paradigms in Western medical history, characterized by the primary clinical locations at which they were practiced: bedside medicine (a holistic approach), hospital medicine (a localized approach), and laboratory medicine (a lab-based approach). It does this by exploring the origins of Western medicine in premodern and medieval contexts. Students will engage in close readings of primary and secondary sources to explore how and why certain diseases, like cancer and tuberculosis, were understood differently within these three paradigms. They will learn to engage in an interdisciplinary dialogue by applying humanities-based methodologies and vocabularies to the study of health and disease. By focusing on historical case studies and asking students to look at how ancient, medieval, and premodern people conceived of health, the course shows how all perceptions of well-being, including our own, are socially constructed and in constant negotiation.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]