[
  {
    "courseId": "016493",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "101",
    "title": "Foundations of Health Humanities",
    "descriptionAbbreviated": "Health Humanities Foundations",
    "description": "Students will learn how diverse humanities disciplines (literature, history, philosophy, and others) contribute to a rich and well-rounded understanding of human health. Through a study of selected moments, concepts, and texts, students will engage with significant representations of health, illness, medicine, and the body from different eras and cultures. Students will have the opportunity to exercise self-awareness and sensitivity to the experience of others and to form skills in text-centred analysis, critical reflection, and careful argumentation.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016498",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "263",
    "title": "Contagion, Disease, and Illness in Italian Literature and Film",
    "descriptionAbbreviated": "Contagion, Disease & Illness",
    "description": "This course will focus on representations of contagion and illness in Italian literature and film. Covering such topics as the portrayal of the Bubonic Plague in 14th-century novelle, Renaissance descriptions of syphilis, Verist and Neo-realist stories about contagion and poverty, and the projection of social malaise in art films, students will assess the ways in which disease is depicted in primary texts. Students will gain familiarity with contemporary contagion theories, as well as historicization and cultural criticism of literary and cinematic accounts of disease. In this course students will consider the psycho-social impact of contagion and disease from multiple perspectives - near and far, past, and present.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016501",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STJ",
    "associatedAcademicOrgCode": "STJ",
    "subjectCode": "HHUM",
    "catalogNumber": "307",
    "title": "Concepts of Health and Disease in Western Medical History",
    "descriptionAbbreviated": "Hlth & Disease West Med Hist",
    "description": "This course introduces students to three paradigms in Western medical history, characterized by the primary clinical locations at which they were practiced: bedside medicine (a holistic approach), hospital medicine (a localized approach), and laboratory medicine (a lab-based approach). It does this by exploring the origins of Western medicine in premodern and medieval contexts. Students will engage in close readings of primary and secondary sources to explore how and why certain diseases, like cancer and tuberculosis, were understood differently within these three paradigms. They will learn to engage in an interdisciplinary dialogue by applying humanities-based methodologies and vocabularies to the study of health and disease. By focusing on historical case studies and asking students to look at how ancient, medieval, and premodern people conceived of health, the course shows how all perceptions of well-being, including our own, are socially constructed and in constant negotiation.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]