[
  {
    "courseId": "013702",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ARTSDEAN",
    "subjectCode": "PS",
    "catalogNumber": "611",
    "title": "Government, Politics and the Public Service",
    "descriptionAbbreviated": "Government and Public Service",
    "description": "Public servants require a thorough understanding of Canada's political system.  This course examines the structure and functions of the Westminster system of government, upon which Canada's is based, and explores the role of the public service in relation to other fundamental institutions of Canadian governance, such as the political executive, the legislature and the judiciary.  Topics examined include the unique context of Canadian politics and public administration, the role of the federal, provincial and municipal levels of government within the Canadian federation, ministerial responsibility and accountability, and contemporary challenges facing the public service.  This course is restricted to students enrolled in the Master of Public Service program.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "PS Grad Students"
  },
  {
    "courseId": "013705",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ARTSDEAN",
    "subjectCode": "PS",
    "catalogNumber": "614",
    "title": "Communicating with Diverse Audiences",
    "descriptionAbbreviated": "Comm. with Diverse Audiences",
    "description": "Public servants often have to become communication specialists: they have to communicate with diverse audiences (e.g. citizen groups, politicians, lawyers, parliamentary committees and subcommittees) using a variety of genres (e.g. reports, records pamphlets, power point presentations, briefs) as well as different modes of communication (e.g. electronic, text, face-to-face).  This course offers participants an opportunity to identify and interrogate the stylistic and visual strategies characteristic of the documents in their workplaces.  Much of the course focuses on identifying the needs of different audiences and aligning stylistic and visual choices to those audiences.  In the process of investigating documentation practices, course participants are offered opportunities to develop their own informal and formal communication skills.  This course is restricted to students enrolled in the Master of Public Service program.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "PS Grad Students"
  },
  {
    "courseId": "013707",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ARTSDEAN",
    "subjectCode": "PS",
    "catalogNumber": "616",
    "title": "Spoken French in Context",
    "descriptionAbbreviated": "Spoken French in Context",
    "description": "Some public service positions require proficiency in both of Canada's official languages, English and French.  This optional course is taught at an intermediate level, and is designed to refresh and reinforce linguistic skills students have acquired through previous French language training (e.g. senior high school or university courses).  It aims to strengthen proficiency in oral expression and comprehension, through the study of specialized vocabulary and situational learning scenarios, such as role-play exercises.  This course is restricted to students enrolled in the Master of Public Service program.",
    "gradingBasis": "CNC",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "PS Grad Students"
  },
  {
    "courseId": "013709",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ARTSDEAN",
    "subjectCode": "PS",
    "catalogNumber": "618",
    "title": "Public Policy Development",
    "descriptionAbbreviated": "Public Policy Development",
    "description": "Public servants are often involved in the development, implementation and evaluation of public policy.  This course examines the dynamics of public policy development in Canada, analyzing the actors, interests and institutions involved in problem identification, policy design, decision-making, implementation and evaluation.  It is designed to equip students with knowledge of the policy process and a framework to analyze and recommend courses of action in response to contemporary problems. This course is restricted to students enrolled in the Master of Public Service program.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "PS Grad Students"
  },
  {
    "courseId": "014428",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ARTSDEAN",
    "subjectCode": "PS",
    "catalogNumber": "624",
    "title": "Research Methods and Data Analysis",
    "descriptionAbbreviated": "Research Methods",
    "description": "To effectively support evidence-based decision making, public servants must be skilled in collective, analyzing, interpreting and presenting data.  This course explores the principles and practices of effective research design, and equips students with essential skills in data collection and analysis.  Topics may include methods of data collection, measurement, data coding, descriptive and inferential statistics, sampling, survey research techniques, questionnaire design, interviews, and research ethics.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "PS Grad Students"
  },
  {
    "courseId": "014734",
    "courseOfferNumber": 1,
    "termCode": "1249",
    "termName": "Fall 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ART",
    "associatedAcademicOrgCode": "ARTSDEAN",
    "subjectCode": "PS",
    "catalogNumber": "625",
    "title": "Economics and Public Policy I",
    "descriptionAbbreviated": "Economics and Public Policy I",
    "description": "This course teaches students fundamental principles of microeconomics with an emphasis on cost-benefit analysis.  Topics covered may include demand and supply, pareto-efficiency, surplus and deadweight loss, discounting, time-stream evaluation and investment criteria, the measurement of welfare change, shadow prices, and the valuation of intangibles.  In order to ensure policy relevance, Treasury Board of Canada guidelines are used as a template for cost-benefit analysis techniques.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "PS Grad Students"
  }
]