[
    {
        "courseId": "013545",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "601",
        "title": "Business and the Case for Sustainability",
        "descriptionAbbreviated": "Bus. Case for Sustainability",
        "description": "This on-site intensive course introduces students to basic business concepts and integrates them with concerns for sustainability.  The underlying emphasis is on the value and rationale, opportunities and risks for businesses to undertake and integrate environmental and social sustainability initiatives.  Business topics to be covered include an introduction to concepts and terminology from finance,accounting, strategy, marketing, organization behaviour and operations.  Guests from academia, industry, governments, and non-profit organizations present topics and case studies.  Students also learn about the MEB program, meet faculty members, meet each other, and are introduced to distance education tools.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    },
    {
        "courseId": "013546",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "602",
        "title": "Introduction to Sustainability for Business",
        "descriptionAbbreviated": "Intro Business Sustainability",
        "description": "This course reviews the history of global environmentalism; societal expectations and business responses; and the emergence of corporate social and environmental responsibility.  It systematically presents environmental (climate change, air pollution, water quality and quantity, energy and resource consumption, etc.), and social (human rights, health, poverty, ethics, fair trade, etc.) issues, their science, status and priority; technological, regulatory and policy responses; and implications for business.  This course introduces concepts for business sustainability, including systems thinking, complexity and resilience, corporate responsibility, materials and energy flows and transformations, economic and market mechanisms, and relates these to business operations, marketing and strategic management.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    },
    {
        "courseId": "013547",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "620",
        "title": "Business Operations and Sustainability",
        "descriptionAbbreviated": "Business Ops & Sustainability",
        "description": "This course examines environmental and sustainability management tools for business operations; it addresses process and product considerations.  These include environmental management system tools; cleaner production and pollution prevention tools (environmental risk management, environmental impact assessment, emissions quantification and verification, eco-efficiency, etc.); product stewardship and eco-design tools (design for environment, life cycle assessment/costing, greening supply chain, etc.); sustainability accounting tools (key performance indicators, ecological footpint, social balance, full cost accounting, etc.); and human resource tools (managing teams, motivating people for sustainability, diversity policies, etc.).  The sustainability tools are explained in relation to health/safety programs, human resources management, and operations and quality management.  The course draws on practices and illustrative examples of performance of organizations in different sectors, around different environmental issues (energy, waste, water, air emissions, etc.).",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "013548",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "630",
        "title": "Enterprise Marketing and Social Accountability",
        "descriptionAbbreviated": "Enterprise Marketing",
        "description": "Changing boundaries, and shifting social expectations create risks and opportunities for an enterprise.  This course discusses the need to remain accountable to society and manage the firm's reputation in the age of digital information and raised sustainability disclosure expectations.  It also examines the implications for marketing and reporting.  The course introduces core tools for corporate sustainability marketing and reporting, including stakeholder engagement approaches, social accountability and carbon disclosure guidelines, sustainability reporting frameworks, sustainability standards, codes, certifications and labels, and green marketing.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "013549",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "640",
        "title": "Strategies for Sustainable Enterprises",
        "descriptionAbbreviated": "Sustainable Enterprises",
        "description": "This course looks at organizational strategy through the \"lens\" of sustainability.  It explores how corporations (and other types of organizations) are realigning and in some cases reinventing their corporate strategies to move toward more sustainable business models.  This includes initiatives undertaken within the firms, as well as initiatives pursued outside the firm (such as through partnerships).  Several frameworks are offered for assessing the degree to which principles of sustainability are embraced within an organization's strategies.  In addition, tools for formulation and implementing a sustainability strategic plan are presented.  Case studies draw from different sectors and also different organizational types.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "013552",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "622",
        "title": "Product Life Cycle Assessment and Management",
        "descriptionAbbreviated": "Product Life Cycle Assess/Mgmt",
        "description": "This course builds students' competencies in environmental life cycle assessment (ICA) and life cycle management of products.  Course content covers product sustainability management, life cycle thinking, product stewardship approaches.  It includes life-cycle assessment of raw materials and energy rescues, manufacturing and processing, use, end-of-life and recycling, supply-chain and logistics.  The content follows international standards and related guidance for study scoping, functional unit, inventory, impact assessment and interpretation.  Management applications include ecodesign, product benchmarking, ecolabelling and green marketing.  The course also presents strengths, limitations and weaknesses of sustainability performance assessment of products.  Students apply quantitative approaches including use of ICA software and databases.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "013554",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "632",
        "title": "Sustainability Reporting",
        "descriptionAbbreviated": "Sustainability Reporting",
        "description": "This course builds students' competencies in sustainability indicators, reporting and corporate accountability approaches for multinational corporations and other types of organizations.  The course examines global reporting standards for environmental, social and sustainability reporting that are relevant to all sectors of industry and society.  It covers the identification and roles of stakeholders certification and auditing expectations and procedures.  Content addresses materiality in sustainability reporting; regulatory context; legal implications; interrelations with financial accounting practices and standards.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "013556",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "642",
        "title": "Stakeholder Engagement, Collaborations and Partnerships",
        "descriptionAbbreviated": "Stakeholders, Collaborations",
        "description": "This course builds competences in the development and deployment of strategies and processes (in for-and not-for-profit organizations) to engage both internal and external stakeholders in opportunities to accelerate sustainability.  Content covers: the identification, characterization and valuation of primary and secondary stakeholders; drivers and challenges; engagement approaches, including traditional and social media forms of communication, consultation, conflict resolution, and cross-sector partnerships.  Content also introduces: structures, including informal vs. formal interactions, face-to-face and distance meetings, industry associations, joint ventures, public-private partnerships, networks and business to not-for-profit collaborations; processes, such as partnership formation, decision-making, monitoring of progress; and strategic considerations, such as business value, risk management, control vs. influence, barriers and confluence points.  Students working as a team will present their recommendations on a real time case study to stakeholders involved.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "013666",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "650",
        "title": "Environmental Finance",
        "descriptionAbbreviated": "Environmental Finance",
        "description": "Financial and accounting \"tools\" have potential to create effective and far-reaching market-based solutions to address a range of environmental problems, including climate change, deforestation, water issues and biodiversity loss, while at the same time identifying and securing new business opportunities for companies and their customers.  An increasing number of financial and accounting products and services have emerged to direct resources and lending power to mitigate ecological degradation and/or encourage sustainable practices and decision-making.  the course considers environmental finance products, tools and services; carbon finance an economics, and other approaches to environmental assets; international capital projects, structured financing, risk and sustainability in financial modeling; full-cost accounting; relation of sustainability performance to capital market valuation and financial performance; socially responsible investing; sector governance, disclosures, regulations, principles and codes.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "014010",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "612",
        "title": "Social Entrepreneurship and Scaling Social Innovation",
        "descriptionAbbreviated": "Social Entrepreneurship",
        "description": "This course explores different approaches that can be used to bring social innovations to scale so that they can have a broad, durable impact on a system.  The role of social entrepreneurs and institutional entrepreneurs will be introduced and explored as being key to catalyzing changes in resource flows, the understanding of problems and in shifting laws and policies that govern the problem domain.  New approaches to generating financing and revenue for social good, the governance and partnership structures these imply, and how they can enable or constrain systems change.  Examples will be drawn from Canadian and international contexts form the perspectives of entrepreneurs, investors/donors, policymakers and beneficiaries",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "014599",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "690A",
        "title": "Enterprise Sustainability Project",
        "descriptionAbbreviated": "MEB Capstone Projects",
        "description": "The capstone class synthesizes the learning in the program into a research project. Students show original application of the knowledge they have learned and reflect on the utility of the frameworks and tools using a case study approach. After learning relevant research methods, student teams develop a proposal on a research project which meets the needs of their live case study (i.e. the company or other organization which has committed to be the case in the research project). This proposal includes a review of the relevant literature, the methodology and project timeline. Where applicable, students obtain ethics approval for their research project. Each field study includes conducting a situation analysis, developing a sustainability strategic plan for the organization. A Faculty member assists each team. Students deliver field study project results as a report to both the organization and the course instructor. Individual students also complete a short reflection paper including a discussion of the case in relation to the application of sustainability frameworks and literature.",
        "gradingBasis": "CNC",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    },
    {
        "courseId": "014600",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "690B",
        "title": "Enterprise Sustainability Project",
        "descriptionAbbreviated": "MEB Capstone Projects",
        "description": "The capstone class synthesizes the learning in the program into a research project. Students show original application of the knowledge they have learned and reflect on the utility of the frameworks and tools using a case study approach. After learning relevant research methods, student teams develop a proposal on a research project which meets the needs of their live case study (i.e. the company or other organization which has committed to be the case in the research project). This proposal includes a review of the relevant literature, the methodology and project timeline. Where applicable, students obtain ethics approval for their research project. Each field study includes conducting a situation analysis, developing a sustainability strategic plan for the organization. A Faculty member assists each team. Students deliver field study project results as a report to both the organization and the course instructor. Individual students also complete a short reflection paper including a discussion of the case in relation to the application of sustainability frameworks and literature.",
        "gradingBasis": "CNC",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    },
    {
        "courseId": "015698",
        "courseOfferNumber": 2,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "652",
        "title": "Business and Climate Change",
        "descriptionAbbreviated": "Business and Climate Change",
        "description": "This course examines the intersection of business management, climate change, and the evolving policy environment within which mitigation and adaptation occurs. A Canadian lens is applied to understanding: climate change business economics; the changing policy and regulatory landscape at the international, national and provincial levels; the ways in which a price on carbon and the need to disclose carbon and climate risk can affect business decision-making; and various opportunities for companies to reduce their carbon footprint to operate in emerging low-carbon economies, make their business more resilient to the impacts of climate change, and identify value-creation opportunities. Leadership cases from businesses worldwide will be explored, including multi-nationals and small and medium sized enterprises.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    }
]