[
  {
    "courseId": "014194",
    "courseOfferNumber": 1,
    "termCode": "1211",
    "termName": "Winter 2021",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "603R",
    "title": "Critical Exploration of Supervision and Leadership Roles for Social Worker",
    "descriptionAbbreviated": "Supervision & Leadership Roles",
    "description": "This course examines effective leadership in a tumultuous health care environment characterized by changing patient populations, health care technologies, professional practices, community needs/expectations, and rapid shifts in service delivery modalities.  In this environment, health care professions are increasingly challenged to develop and oversee staff capable of delivering contemporary benchmark professional practice.  Competent supervision requires practice knowledge, keen perspective, and the ability to support, guide, educate and direct practitioners of varying skill and experience.  This course provides inquiry-based opportunities for students to critically examine their leadership styles, developing foundational knowledge and skills for effective involvement in organizational change, staff management, coaching and supervision, coordination of inter-professional teams and development of policies to address the social determinants of health.  (Note:  This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students Only"
  },
  {
    "courseId": "014196",
    "courseOfferNumber": 1,
    "termCode": "1211",
    "termName": "Winter 2021",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "605R",
    "title": "Knowledge Mobilization and Evidence-Based Practice",
    "descriptionAbbreviated": "Knowledge Mobilization & Pract",
    "description": "The goal of knowledge mobilization is to make research in health and social science more useful to policy, practice, and the public.  In this course students can learn how to gather, evaluate, synthesize and summarize scholarly knowledge in ways that meet the needs, timeframes, cultures, and realities of stakeholders. Activities include framing academic research in the context of public issues and creating knowledge products for practitioners and policy-makers in the students' areas of interest.  (Note:  This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students Only"
  },
  {
    "courseId": "014653",
    "courseOfferNumber": 1,
    "termCode": "1211",
    "termName": "Winter 2021",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "650R",
    "title": "Interprofessional Psychosocial Oncology: Introduction to Theory and Practice",
    "descriptionAbbreviated": "Intro Psychosocial Oncology",
    "description": "This elective course provides graduate students with an introduction to the field of psychosocial oncology.  Emphasis will be placed on understanding and interpreting the experience of cancer informed by theory, evidence and illness narratives. Case based learning in small interprofessional groups will allow students to explore a variety of key learning themes relevant to psychosocial oncology including distress assessment, depression, anxiety, adjustment and coping, sexuality, loss and grief. Small group work will allow students to develop a rich understanding of the cancer experience and competency in psychosocial oncology assessment, interprofessional collaboration, and cultural safety. Attention to diversity will be integrated throughout the course.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students Only"
  }
]