[
  {
    "courseId": "014190",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "609R",
    "title": "Clinical Practice in Mental Health and Addictions",
    "descriptionAbbreviated": "Mental Health and Addictions",
    "description": "This course aims to equip students to provide sensitive and effective help to clients by presenting material concerning a range of mental health problems, assessment and treatment. The course considers clinical social work approaches across the continuum of mental health and addiction. Attention is focused on how social workers assess, document, support and intervene with consideration of the client, their family and social environment. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014191",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "601R",
    "title": "Health Policy",
    "descriptionAbbreviated": "Health Policy",
    "description": "This course offers critical analysis of health policy formulation, implementation, and evaluation related to population health initiatives and health care delivery.  The course includes discussion of the role of various regional, provincial, and national agencies in health care policy formation.  It examines various health care systems, and their funding as well as investigates how the Canadian healthcare system compares with systems in other countries.  (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014194",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "603R",
    "title": "Social Work Leadership in Health Care",
    "descriptionAbbreviated": "Social Work Leadership",
    "description": "This course examines the theories and practice skills of effective social work leadership within health care contexts, social service organizations, and community service delivery systems. The effective and responsible use of human and material resources are emphasized through a social justice lens, while knowledge and skills for ethical and value-based leadership in staff management and organizational change processes, coordination of inter-professional teams, creating a positive organizational culture, and policies to address the social determinants of health are addressed. Supervision will be examined as one form of leadership, where functions and skills of supervisory practice and the organizational contexts will be considered. Learners will be invited to critically examine and expand their own leadership style and skills via an inquiry-based approach, while developing foundational knowledge and skills for best practices in organizations. Development of styles of leadership, management and supervision that are respectful, reflective, and relational in nature are encouraged. (Note: This is an intensive on campus course with an online component).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014655",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "652R",
    "title": "Sexual Health & Counseling in Cancer",
    "descriptionAbbreviated": "Sexual Hlth & Counselg Cancer",
    "description": "Cancer causes wide-ranging impacts on sexual health and well-being and numerous studies have identified that people affected by cancer want support, education and counseling in this area. While health professionals consistently acknowledge that sexuality is within their scope of practice, few health professionals consistently assess or intervene in sexual health problems in cancer settings. This course is designed to provide graduate students in the health professions with the knowledge and skills to intervene with the sexual problems that arise in cancer.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "015169",
    "courseOfferNumber": 1,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "653R",
    "title": "Grief and Palliative Care in Social Work",
    "descriptionAbbreviated": "Grief & Palliative Care in SW",
    "description": "Grief is a part of the human experience that often occurs when a person dies. Social workers should be familiar with the concept for all aspects of practice. Palliative care is a model of health care for people with terminal illnesses, along with their families, in order to relieve suffering and improve quality of life. Palliative care is delivered by an interprofessional team which is most often comprised of medicine, nursing, social work and chaplaincy; other professions are often involved such as pharmacy, occupational therapy and others. This course addresses the social work role in grief and palliative care. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Masters Students"
  },
  {
    "courseId": "016294",
    "courseOfferNumber": 2,
    "termCode": "1225",
    "termName": "Spring 2022",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "654R",
    "title": "Indigenous Health and Social Justice",
    "descriptionAbbreviated": "Indigenous Health Justice",
    "description": "This interdisciplinary course is intended to engage and advance knowledge and practice in Indigenous health with a focus on social justice. Students will learn about health inequities that face First Nations, Métis, and Inuit Peoples in rural and urban contexts within Canada as well as Indigenous Peoples internationally who have been impacted by processes of colonization. The course will critically examine how health status indicators are  measured and used as well as link determinants of Indigenous Peoples' health to historical and ongoing colonial priorities and practices. Some of the disparities in health and social issues, access to care, and systemic challenges including racism experienced by Indigenous Peoples in different regions and contexts will be shared as points for discussion. An intersectionality lens will be applied in consideration of the unique health experiences among Indigenous Peoples, including Indigenous women, youth, and Two Spirit people. Innovative approaches to healing and community-based ethical practices will also be profiled in social work and health care delivery, research, policy, and programming. The perspectives of Indigenous Peoples will be highlighted in this course, through a variety of readings, film and other arts-based narratives, including Indigenous scholars and community activists in the delivery and discussion of course materials.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]