[
  {
    "courseId": "014193",
    "courseOfferNumber": 1,
    "termCode": "1231",
    "termName": "Winter 2023",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "602R",
    "title": "Social Work Practice in Health",
    "descriptionAbbreviated": "Social Work Practice in Health",
    "description": "This course examines practice models and multi-level methods of intervention for effective social work practice in health care, including health promotion, disease prevention, assessment treatment, rehabilitation, continuing care, and discharge planning within the context of social, economic, environmental, and cultural variations. The distribution and determinants, as well as psychological and behavioural aspects of health and disease across the life span are addressed. Practice models incorporate competence and empowerment as central themes. Different practice models of care are explored within the context of socio-cultural factors that inform health and well-being. Differences between the concepts of illness and disease are explored within the healthcare narrative. Resource allocation in the management of chronic and complex health conditions is examined, and interventions that support individual and family capacity to adapt to health crises or chronic health conditions are considered.\n(Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014210",
    "courseOfferNumber": 1,
    "termCode": "1231",
    "termName": "Winter 2023",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "608R",
    "title": "Health Issues and Ethics",
    "descriptionAbbreviated": "Health Issues and Ethics",
    "description": "This course considers the nature of health itself, and explores the complexities of a health care system that corresponds with social work values and ethics while remaining sustainable. Three related themes serve as substrates for the semester: the nature of health, delivery of health care, and specific health experiences that are characterized by inequity, societal change, and/or a\nparticular ethical dilemma. Issues such as how health and illness are defined, cultural safety, the roles of preventive and curative approaches, and the impacts and ethics of new technologies and societal change will be addressed. The course critiques public, private, and individualized models of health, focuses on community health care, and examines the particular challenges of marginalized communities. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014653",
    "courseOfferNumber": 1,
    "termCode": "1231",
    "termName": "Winter 2023",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "650R",
    "title": "Interprofessional Psychosocial Oncology: Introduction to Theory and Practice",
    "descriptionAbbreviated": "Intro Psychosocial Oncology",
    "description": "This elective course provides graduate students with an introduction to the field of psychosocial oncology.  Emphasis will be placed on understanding and interpreting the experience of cancer informed by theory, evidence and illness narratives. Case based learning in small interprofessional groups will allow students to explore a variety of key learning themes relevant to psychosocial oncology including distress assessment, depression, anxiety, adjustment and coping, sexuality, loss and grief. Small group work will allow students to develop a rich understanding of the cancer experience and competency in psychosocial oncology assessment, interprofessional collaboration, and cultural safety. Attention to diversity will be integrated throughout the course.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "016429",
    "courseOfferNumber": 1,
    "termCode": "1231",
    "termName": "Winter 2023",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "606R",
    "title": "Advanced Social Work Research",
    "descriptionAbbreviated": "Advanced Social Work Research",
    "description": "The goal of this course is to deepen students' knowledge of the ways in which research can be produced, used, and disseminated in social work practice. The course will address research ethics, theories, and methods, and examine how different approaches can influence relationships and practices across community and health care settings. Students will develop their abilities to assess existing research studies, and will explore how they can engage in new research as social workers. Activities include literature reviews, interviews, surveys, and knowledge dissemination strategies. Particular attention will be paid to program evaluation and knowledge mobilization, and to how these may be used to improve services and further social justice in students' own organizations and communities. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  }
]