[
  {
    "courseId": "014190",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "609R",
    "title": "Clinical Practice in Mental Health and Addictions",
    "descriptionAbbreviated": "Mental Health and Addictions",
    "description": "This course aims to equip students to provide sensitive and effective help to clients by presenting material concerning a range of mental health problems, assessment and treatment. The course considers clinical social work approaches across the continuum of mental health and addiction. Attention is focused on how social workers assess, document, support and intervene with consideration of the client, their family and social environment. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014194",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "603R",
    "title": "Social Work Leadership in Health Care",
    "descriptionAbbreviated": "Social Work Leadership",
    "description": "This course examines the theories and practice skills of effective social work leadership within health care contexts, social service organizations, and community service delivery systems. The effective and responsible use of human and material resources are emphasized through a social justice lens, while knowledge and skills for ethical and value-based leadership in staff management and organizational change processes, coordination of inter-professional teams, creating a positive organizational culture, and policies to address the social determinants of health are addressed. Supervision will be examined as one form of leadership, where functions and skills of supervisory practice and the organizational contexts will be considered. Learners will be invited to critically examine and expand their own leadership style and skills via an inquiry-based approach, while developing foundational knowledge and skills for best practices in organizations. Development of styles of leadership, management and supervision that are respectful, reflective, and relational in nature are encouraged. (Note: This is an intensive on campus course with an online component).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "015169",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "653R",
    "title": "Grief and Palliative Care in Social Work",
    "descriptionAbbreviated": "Grief & Palliative Care in SW",
    "description": "Grief is a part of the human experience that often occurs when a person dies. Social workers should be familiar with the concept for all aspects of practice. Palliative care is a model of health care for people with terminal illnesses, along with their families, in order to relieve suffering and improve quality of life. Palliative care is delivered by an interprofessional team which is most often comprised of medicine, nursing, social work and chaplaincy; other professions are often involved such as pharmacy, occupational therapy and others. This course addresses the social work role in grief and palliative care. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Masters Students"
  },
  {
    "courseId": "016294",
    "courseOfferNumber": 2,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "654R",
    "title": "Indigenous Wellbeing, Health, and Social Justice",
    "descriptionAbbreviated": "Indigenous Wellbeing",
    "description": "This interdisciplinary course is intended to engage and advance knowledge and practice in Indigenous wellbeing and health through a social justice lens. The course critically links determinants of Indigenous Peoples wellbeing and health to historical and ongoing colonial priorities and practices. Disparities in health and social issues, access to care, and systemic challenges, including racism experienced by Indigenous Peoples in different regions and contexts, are shared as points for discussion and reflection. An intersectionality lens is applied in consideration of the unique wellbeing and health experiences among Indigenous Peoples, including Indigenous women, youth, and Two Spirit Peoples. Indigenous approaches to science, healing, and community-based ethical practices are also profiled in social work and health care delivery, research, policy, and programming. The knowledges, values, and perspectives of Indigenous Peoples are highlighted throughout this course, incorporated within a variety of resources including readings, film and other arts-based narratives that include Indigenous scholars and community activists, in the delivery of course content and assignments. This course was created in consultation with a local Indigenous Advisory Circle that included community-based Indigenous Elders, health leaders, social workers, and academics involved in Indigenous initiatives and research. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016430",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "680R",
    "title": "Critical Topics in Social Work and Health",
    "descriptionAbbreviated": "Critical Topics SW and Health",
    "description": "This is a multi-module course that introduces students to key topics in social work and health through a critical lens (e.g., gerontology, mental health, community health, etc.). Students have the option of choosing 3 modules (topics), each being 4-weeks in duration. The common theme across the modules is the critical theories that frame the examination of each module topic. Students will further develop understanding of critical theoretical frameworks and their application to contemporary health discourses and health services and systems. Each module will underscore how the critical framing of health discourses and health services and systems are engaged as a method of identifying and responding to health inequities and diverse understandings of health and illness. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  }
]