[
  {
    "courseId": "013817",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "602",
    "title": "Grant Writing in the Sciences",
    "descriptionAbbreviated": "Grant Writing in the Sciences",
    "description": "The course is designed to teach the student how to critically review the literature, ask the right scientific questions, generate hypotheses, and write a professional curriculum vita and a fundable grant proposal.  The course will include lectures from the instructor and guest speakers, small group discussion, student presentations and a final written grant proposal.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013818",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "603",
    "title": "Selected Topics in Medicinal Chemistry",
    "descriptionAbbreviated": "Topics in Medicinal Chemistry",
    "description": "This course provides an introduction to basic principles in medical chemistry such as physiochemical properties, drug design and pharmacological actions.  A brief overview of the theory and application of computer aided drug design principles will provide a basic understanding of the \"in silico\" drug design concepts.  The student will develop an understanding toward the concepts of peptide/petidomimetic design as therapeutic agents.  A series of case studies on clinical drugs will be presented with major emphasis on their design, synthesis, reaction mechanisms and structure-activity relationship studies.  A section of the course will address the pathophysiology and pharmacology of diseases affecting the central nervous system.  In addition, learning activities and assignments include a term paper submission and in class presentation of current topics in medicinal chemistry.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013819",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "604",
    "title": "Gene Therapy",
    "descriptionAbbreviated": "Gene Therapy",
    "description": "Gene therapy offers extraordinary potential to treat both inherited and acquired diseases by using the body's own machinery to produce a therapeutic compound or protein, or up-regulate/down-regulate specific cellular processes.  This course will examine the various extra- and intracellular barriers to DNA transfection, and the common vectors used in gene therapy.  Various routes of administration, such as injected, inhaled, and transdermal will be discussed in terms of their challengers, and the successes of recent formulations described in the literature.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013820",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "605",
    "title": "Physical Chemistry and Application of Surfactants",
    "descriptionAbbreviated": "Physical Chem. and Surfactants",
    "description": "Surface active compounds, more commonly known as surfactants are found in nearly every aspect of day to day life, including motor oils, pharmaceuticals, cosmetics, detergents, and paints and inks to name a few.  This course will introduce the student to the structures of classical and emerging classes of surfactants and their fundamental properties that make these systems so useful.  The self-assembly of these compounds into micelles will be discussed in detail using both thermodynamic and kinetic modules and modern methods of characterizing these systems will be examined.  The application of surfactants in a variety of industries will be introduced.  The capstone activity of this course will entail a critical analysis of a relevant recent journal article, and presentation to the class.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013821",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "606",
    "title": "Neuroscience in the 21st Century",
    "descriptionAbbreviated": "Neuroscience",
    "description": "Intensively examines medical and technological advances in neuroscience.  Students will first develop a deep understanding of the structure and function of the central nervous system, neuronal cell biology and physiology, and neurotransmission.  Explores selected CNS disease states and identify mechanisms of neuropathology by biological, environmental, and iatrogenic causes.  Advances in technology and nanotechnology is and will continue to transform the treatment of diseases of the nervous system and these issues will be explored by expert guest lecturers.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013822",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "607",
    "title": "Advanced Pharmaceutical Analysis",
    "descriptionAbbreviated": "Advanced Pharmaceutical Analys",
    "description": "This course provides an introduction to modern spectroscopic methods with emphasis on pharmaceutical analysis.  First few lectures will cover the theory and application of UV-Vis and IR spectroscopy.  A review of NMR spectroscopy will focus on commonly used techniques such as 1H NMR and 13C NMR and their application.  The student will get a practical experience in spectroscopic methods for structural elucidation by using UVS-VIS, IR and NMR spectrometers. In addition, a section will address the theory and application of mass spectrometry. Examples of drug molecules/pharmaceuticals and their spectroscopic characteristics will be discussed.  In addition, learning activities and assignments include problem sets and structural elucidation of an unknown organic molecule.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013919",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "608A",
    "title": "Selected Topics in Pharmaceutical Sciences 1",
    "descriptionAbbreviated": "Selected Topics in PharmSci 1",
    "description": "This course will discuss specialized topics that are related to the research interests of faculty members in the field of Pharmaceutical Sciences.  Topics could include, for example, the areas of drug delivery systems, diabetes, bacteriophage derived therapeutics, central nervous disorders, medicinal chemistry, pharmacokinetics, biophysical methods, bionanotechnology, nanomedicine among others.  This course may be presented in any of the following formats, reading based, lecture based, project based or online learning.",
    "gradingBasis": "NUM",
    "courseComponentCode": "RDG",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014082",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "609",
    "title": "Advanced Pharmacokinetics",
    "descriptionAbbreviated": "Advanced Pharmacokinetics",
    "description": "This course provides statistical hands-on knowledge for the implementation of nonlinear mixed effects (NLME) models in the analysis of population pharmacokinetic data. In order to provide a foundation for NLME, the content builds from simple to multiple linear regression models and to linear mixed effects models. Exploratory and descriptive analyses as well as model implementation will be taught in R and Phoenix.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014083",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "610",
    "title": "Topics in Drug Development",
    "descriptionAbbreviated": "Topics in Drug Development",
    "description": "This course will cover all aspects of drug development, from basic research through to post-marketing surveillance of drug safety and efficacy.  Faculty members from the UW School of Pharmacy and beyond will provide their expertise on aspects of the drug development process.  Students will gain valuable knowledge and appreciation of the drug development process from \"bench to bedside\".  Using real-life drug research problems, students will learn how identification of disease stat pathophysiology directs drug design, how medicinal chemistry optimizes lead molecule creation, how drug dosage forms are designed, pharmacokinetic studies, how animal models are used to test the efficacy and toxicity of lead compounds, the design and evaluation of clinical trials, drug manufacturing, perspectives from the pharmaceutical industry, as well as business and regulatory issues.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014366",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "611",
    "title": "Special Topics in Pharmacy Practice",
    "descriptionAbbreviated": "Special Topics in Pharm Prac",
    "description": "This course will discuss specialized topics that are of mutual interest to the research of faculty members and graduate students in the field of Pharmacy Practice.  Topics could include, for example, pharmacy education; rural pharmacy practice; geriatrics and aging; pharmacoepidemiology; the role of technology in primary care; chronic disease management; expanded scope of practice; collaborative practice in different settings; health services design and care delivery; among others. This course may be presented in any of the following formats, reading based, lecture based, project based, or online learning.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014780",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "613",
    "title": "Principles and Practices in Systemic Treatments for Cancer",
    "descriptionAbbreviated": "Systemic Cancer Therapeutics",
    "description": "This course is designed to accommodate graduate students from a variety of backgrounds who wish to increase their understanding of cancer and its treatment.  It will cover the full range of issues involved in the rational use of anti-cancer agents, from the older cytotoxic drugs through to newer agents targeted at particular steps in cell regulatory pathways.  A broad overview of the pathology of cancer is included.  Although drug mechanisms will be addressed, there is an equivalent emphasis on what these drugs mean to the patient.  Students will consider the disease itself, the behavior of the diagnosed patient, the issues around drug administration, the extensive side effects and the various supportive strategies that are required to take the patient through the very stressful course of systemic cancer therapy.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014939",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "601",
    "title": "MSc Thesis Proposal",
    "descriptionAbbreviated": "MSc Thesis Proposal",
    "description": "This course prepares MSc in Pharmacy students to present their research objectives and proposed methods in written and oral form suitable for an MSc program and involves preparation of a written research proposal and oral defence of the proposal. The written proposal and the oral presentation of the proposal will be considered by an examination committee.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014953",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "614",
    "title": "Systematic Review and Meta-Analysis",
    "descriptionAbbreviated": "Systematic Rev.& Meta-Analysis",
    "description": "This course will provide students with an overview of the rationale and stages involved in the conduct of a formal systematic review and meta-analysis of a well-defined clinical/health research question. The overarching aim is to provide students with the tools to critically appraise and conduct a systematic review and meta-analysis.  Students will largely work in pairs to progress through each step involved (with feedback from instructors at each stage) and to produce a final systematic review and meta-analysis to be presented/submitted at the end of the course.  \r\nCourse Objectives:\r\n1.  To demonstrate an understanding of the rationale underlying a systematic review and meta-analysis and relevance to clinical care and health policy;\r\n2.  To critically appraise a systematic review;\r\n3.  To develop a focused research question amenable to a systematic review;\r\n4.  To develop and implement a comprehensive and systematic literature search strategy;\r\n5.  To determine and apply procedures for including/excluding potential studies for a systematic review and meta-analysis;\r\n6.  To develop and implement a data abstraction process and study database;\r\n7.  To demonstrate an understanding of the fundamental statistical/biostatistical issues relevant to the conduct of a formal systematic review and meta-analysis.\r\n8.  To perform statistical analyses for a systematic review and meta-analysis and complete/present a final report demonstrating all stages involved.\r\n\r\nStudents will need to meet with Course Coordinators and provide of appropriate previous experience with linear and/or logistic regression techniques.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014959",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "615",
    "title": "Strategic Management of Biopharmaceutical Technology",
    "descriptionAbbreviated": "Strategic Mgt Biopharma Tech",
    "description": "The strategic development and commercialization of novel and incremental bio/pharma technological innovation is rapidly expanding across all industries and with it comes the need for adept management of the process.  Effective management involves ensuring technological precaution such that the risks and ambiguities associated with advanced technologies are minimized.  Additionally, management must be strategic to maximize the successful achievement of corporate objectives based on the alignment of internal resources with the external environment. The transfer of technology from lab to market and successful propagation is usually impeded by a lack of cohesion between scientific understanding and business adeptness.  This course also serves to analyse and connect scientific principles underlying novel and incremental technologies with strategic management and the commercialization process from an entrepreneurial perspective.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "015241",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "616A",
    "title": "PhD Thesis Proposal",
    "descriptionAbbreviated": "PhD Thesis Proposal",
    "description": "This course prepares PhD in Pharmacy students to present their research objectives and proposal methods in written and oral form suitable to a PhD program and involves the preparation of a written research proposal and oral defence of the proposal. The written and oral proposal will be considered by an examination committee that normally includes the student's Thesis Advisory Committee plus an independent Chair. This course is only available for the first Thesis Proposal taken within the Pharmacy Program.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Antireq: PHARM 601"
  },
  {
    "courseId": "015361",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "617",
    "title": "Formulations",
    "descriptionAbbreviated": "Formulations",
    "description": "The formulation of chemicals into products for specific purposes dates back to the stone age. Formulated products are now part of everyday life and include pharmaceuticals, cosmetics, personal care products, detergents, agricultural products, etc. This course will examine the chemical formulation of various consumer products with an emphasis on pharmaceutical formulations; major components used in formulations, surface chemistry, and molecular interactions will be discussed. Analytical methods for testing formulations, raw materials, and environmental and sustainability considerations will also be discussed.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "015872",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "618",
    "title": "Applied Health Economics and Pharmacoeconomics",
    "descriptionAbbreviated": "Appl Hlth Econ & Pharmacoecon",
    "description": "This course will take a practical approach to health economics and pharmacoeconomics. Students will learn about relevant methods of evaluating diagnostic and therapeutic strategies in order to optimize individualized patient care and inform policy decision, including those in which a fixed amount of resources are an important consideration. Topics include preference-based measures of health-related quality of life and quality-adjusted life years, key principles of economic evaluation and decision-analytic modeling, and critical appraisal of economic evaluation studies. Students will also learn to use decision analysis software to build and test their own pharmacoeconomics analyses.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Antireq: PHARM 608A Tpc 15, HLTH 632, ECON 643"
  },
  {
    "courseId": "016233",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "619",
    "title": "Drug Discovery",
    "descriptionAbbreviated": "Drug Discovery",
    "description": "This course provides an opportunity for students to design experiments and carry out\nindependent research projects in the area of neurodegenerative disorders. Student projects are aimed to study\nthe pathophysiology of Alzheimer¿s disease and related neurodegenerative disorders by various techniques such\nas designing novel small molecules and peptides by computational chemistry. Furthermore, the interactions\nbetween small molecules/peptides with misfolded proteins/peptides will be evaluated by biochemical and\nbiophysical techniques with emphasis on fluorescence spectroscopy and ligand-protein kinetic studies.\nMicroscopy techniques including transmission electron microscopy (TEM) analysis will be studied. Students will\nbe trained in using the computational chemistry software Discovery Studio Structure-Based-Design. Individual\nstudent projects may include compound characterization by nuclear magnetic resonance spectroscopy (NMR),\nhigh performance-liquid chromatography (HPLC) and liquid chromatography mass spectrometry (LC-MS)\ntechniques. Students are expected to spend between 10-11 weeks in the research lab working on their assigned\nprojects. Course re-requisite include completion and proof of safety training including WHMIS, workplace\nviolence training and safety orientation.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Antireq: PHARM 608A Topic 8"
  },
  {
    "courseId": "016246",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "616B",
    "title": "PhD Thesis Proposal",
    "descriptionAbbreviated": "PhD Thesis Proposal",
    "description": "This course prepares PhD in Pharmacy students to present their research objectives and proposal methods in written and oral form suitable to a PhD program. The written and oral proposal will be considered by an examination committee that normally includes the student's Thesis Advisory Committee plus an independent Chair. This course is for students who previously completed Pharm 601 in their MSc in Pharmacy program and are required to fulfill a second Thesis Proposal where no additional course credit is available.",
    "gradingBasis": "CNC",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: PHARM 601"
  },
  {
    "courseId": "016247",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "656",
    "title": "Analysis of Quantitative Health Care Data",
    "descriptionAbbreviated": "Data Analysis",
    "description": "This course is designed to teach students the fundamentals of planning, conducting, and communicating the analysis of\nquantitative data within the context of applied health research. Students will learn quantitative data analysis through\nhands-on experience using different sources of data (e.g., clinical trial, cross-sectional survey, prospective cohort, etc.).\nTopics will include descriptive statistics, t-Test, ANOVA, linear regression, logistic regression, poisson regression, and\nproportional hazards regression. Several techniques to adjust for confounding will be covered. Students will learn to\napply their analytic skills using SAS.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016370",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "651",
    "title": "Advanced Principles of Medication Management 1",
    "descriptionAbbreviated": "Medication Management 1",
    "description": "Students will learn advanced principles of drug action, pharmacogenomics, pharmacokinetics and therapeutics and will apply these principles to identifying and resolving drug-related problems in a variety of therapeutic areas.  A problem-based learning approach will be used to maximize student learning.",
    "gradingBasis": "CNC",
    "courseComponentCode": "TUT",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016371",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "652",
    "title": "Advanced Principles of Medication Management 2: Practicum",
    "descriptionAbbreviated": "Med Management 2 Practicum",
    "description": "Students will apply and further strengthen the foundational knowledge and skills\ndeveloped in PHARM 651 Advanced Principles of Medication Management 1.",
    "gradingBasis": "NUM",
    "courseComponentCode": "PRA",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: PHARM 651"
  },
  {
    "courseId": "016372",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "653",
    "title": "Methods in Clinical and Applied Research",
    "descriptionAbbreviated": "Clinical Research",
    "description": "This course will provide an overview of common research methods used to address questions in clinical, applied and translational research. Research ethics and responsible conduct of research will be addressed. This course will touch on basic concepts in successful grant writing.",
    "gradingBasis": "CNC",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016373",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "654",
    "title": "Critical Appraisal and Evidence-Based Practice",
    "descriptionAbbreviated": "Critical Appraisal",
    "description": "Students will identify and critique papers from the primary drug literature. Skills related to critical appraisal and evidence-based practice will be developed. Students will have the opportunity to develop communications skills related to presenting scientific literature.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016374",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "655",
    "title": "Physical Assessment and Clinical Laboratory Testing",
    "descriptionAbbreviated": "Physical Assessment",
    "description": "Fundamental skills of physical assessment and the interpretation of clinical laboratory tests relevant to monitoring the effects associated with the use of medications will be covered.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LAB",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016435",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "657",
    "title": "Substance Use in Primary and Community Care",
    "descriptionAbbreviated": "Substance Use Prim & Comm Care",
    "description": "In Pharmacy and other health care professions mental health and addictions work is often carried out in specialized settings and is focused on pathological substance use and use disorder. Addictions research is also almost entirely dedicated to substance use disorder and treatment. In most community and primary settings, stigma about substance use presents an additional barrier to addressing the impacts of substance use on disease and medication management. This course focuses on substance use in any form and how it affects disease progression, pharmaceutical care including drug interactions, and public health. We identify traditional and emerging types of research and information, including data from non-medical research sources. Community engagement and the pharmacists becoming a community substance educator will be explored. Drug and drug classes covered include opioids, methamphetamine, cocaine, prescription and other stimulants, GABAergic drugs, serotonergic, glutamatergic, and cholinergic hallucinogens, entactogens, alcohol, nicotine, and cannabis.",
    "gradingBasis": "NUM",
    "courseComponentCode": "DIS",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016724",
    "courseOfferNumber": 1,
    "termCode": "1241",
    "termName": "Winter 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "SCI",
    "associatedAcademicOrgCode": "PHARM",
    "subjectCode": "PHARM",
    "catalogNumber": "658",
    "title": "Advanced Principles of Medication Management 3: Practicum",
    "descriptionAbbreviated": "Med Management 3 Practicum",
    "description": "Students will apply and further strengthen the foundational knowledge and skills developed in PHARM 651 Advanced Principles of Medication Management 1.",
    "gradingBasis": "NUM",
    "courseComponentCode": "PRA",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: PHARM 651"
  }
]