[
  {
    "courseId": "016628",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "600",
    "title": "Systems, Synergy, Collaboration",
    "descriptionAbbreviated": "Systems, Synergy, Collaboratio",
    "description": "This intensive block course sets the groundwork for students to understand the systemic nature of urban challenges, the complex reality of leading change in volatile circumstances and the power of collaborative engagement to build a sustainable future. Through practice-based learning, students will identify leverage points for change-making as they build their capacity for distributed knowledge and action. They will also\ndevelop professional skills required to lead collaborative teams in the context of designing and implementing urban sustainability initiatives. The course is delivered in modules focusing on systems analysis, problem identification in uncertain futures, team collaboration, as well as effective virtual and live engagement and participation processes. Students will build their knowledge of the characteristics of effective strategic decision making in multi-stakeholder contexts.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "MFC Grad Students"
  },
  {
    "courseId": "016629",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "601",
    "title": "Tools for Futures Thinking",
    "descriptionAbbreviated": "Tools for Futures Thinking",
    "description": "Through theory and practice, this progressive project-based course will introduce foresight methods used in the development of strategic proposals related to urban sustainability. Working in teams, students will identify an issue in a specific predefined sector. Their exploration and research begins with a divergent process of signal discovery of emerging issues and trends through methods such as environmental scanning, new technology research, user research, field study, or stakeholder workshops. In a subsequent convergent process, students will then learn and apply methodologies, including medium-to long-range exploratory scenario planning, to develop insights and implications for action. A strategic innovation response will then be stress tested against scenarios to evaluate effectiveness and systemic fit for the defined urban context. Students will develop futures literacy skills to make sense of complex emergence and gain confidence in their ability to frame positive responses to change.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600; Master of Future Cities students only"
  },
  {
    "courseId": "016632",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "602",
    "title": "Future Thinking and Cities",
    "descriptionAbbreviated": "Future Thinking and Cities",
    "description": "This course focuses on thinking about the future in ways that intersect with the urban phenomenon. It explores visions of the future, including the different objectives, impacts, potential, and limitations of these visions. This course looks at how visions of the future can inform human behaviour as people adapt to possible futures or, indeed, shape the future.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600; Master of Future Cities students only"
  },
  {
    "courseId": "016636",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "609",
    "title": "Mobility Futures",
    "descriptionAbbreviated": "Mobility Futures",
    "description": "Taking a systems approach, this course focuses on exploratory mobility futures with an emphasis on personal transportation in urban areas. Technological innovation and transport automation and their interactions with socio-demographics, the nature of work, land use planning, and energy systems are used to develop scenarios of different plausible futures and for identifying the challenges and opportunities that may emerge.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]