[
    {
        "courseId": "014082",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "SCI",
        "associatedAcademicOrgCode": "PHARM",
        "subjectCode": "PHARM",
        "catalogNumber": "609",
        "title": "Advanced Pharmacokinetics",
        "descriptionAbbreviated": "Advanced Pharmacokinetics",
        "description": "This course provides statistical hands-on knowledge for the implementation of nonlinear mixed effects (NLME) models in the analysis of population pharmacokinetic data. In order to provide a foundation for NLME, the content builds from simple to multiple linear regression models and to linear mixed effects models. Exploratory and descriptive analyses as well as model implementation will be taught in R and Phoenix.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "014083",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "SCI",
        "associatedAcademicOrgCode": "PHARM",
        "subjectCode": "PHARM",
        "catalogNumber": "610",
        "title": "Topics in Drug Development",
        "descriptionAbbreviated": "Topics in Drug Development",
        "description": "This course will cover all aspects of drug development, from basic research through to post-marketing surveillance of drug safety and efficacy.  Faculty members from the UW School of Pharmacy and beyond will provide their expertise on aspects of the drug development process.  Students will gain valuable knowledge and appreciation of the drug development process from \"bench to bedside\".  Using real-life drug research problems, students will learn how identification of disease stat pathophysiology directs drug design, how medicinal chemistry optimizes lead molecule creation, how drug dosage forms are designed, pharmacokinetic studies, how animal models are used to test the efficacy and toxicity of lead compounds, the design and evaluation of clinical trials, drug manufacturing, perspectives from the pharmaceutical industry, as well as business and regulatory issues.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "014939",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "SCI",
        "associatedAcademicOrgCode": "PHARM",
        "subjectCode": "PHARM",
        "catalogNumber": "601",
        "title": "MSc Thesis Proposal",
        "descriptionAbbreviated": "MSc Thesis Proposal",
        "description": "This course prepares MSc in Pharmacy students to present their research objectives and proposed methods in written and oral form suitable for an MSc program and involves preparation of a written research proposal and oral defence of the proposal. The written proposal and the oral presentation of the proposal will be considered by an examination committee.",
        "gradingBasis": "NUM",
        "courseComponentCode": "SEM",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "015241",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "SCI",
        "associatedAcademicOrgCode": "PHARM",
        "subjectCode": "PHARM",
        "catalogNumber": "616A",
        "title": "PhD Thesis Proposal",
        "descriptionAbbreviated": "PhD Thesis Proposal",
        "description": "This course prepares PhD in Pharmacy students to present their research objectives and proposal methods in written and oral form suitable to a PhD program and involves the preparation of a written research proposal and oral defence of the proposal. The written and oral proposal will be considered by an examination committee that normally includes the student's Thesis Advisory Committee plus an independent Chair. This course is only available for the first Thesis Proposal taken within the Pharmacy Program.",
        "gradingBasis": "NUM",
        "courseComponentCode": "SEM",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Antireq: PHARM 601"
    },
    {
        "courseId": "016246",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "SCI",
        "associatedAcademicOrgCode": "PHARM",
        "subjectCode": "PHARM",
        "catalogNumber": "616B",
        "title": "PhD Thesis Proposal",
        "descriptionAbbreviated": "PhD Thesis Proposal",
        "description": "This course prepares PhD in Pharmacy students to present their research objectives and proposal methods in written and oral form suitable to a PhD program. The written and oral proposal will be considered by an examination committee that normally includes the student's Thesis Advisory Committee plus an independent Chair. This course is for students who previously completed Pharm 601 in their MSc in Pharmacy program and are required to fulfill a second Thesis Proposal where no additional course credit is available.",
        "gradingBasis": "CNC",
        "courseComponentCode": "SEM",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: PHARM 601"
    },
    {
        "courseId": "016435",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "SCI",
        "associatedAcademicOrgCode": "PHARM",
        "subjectCode": "PHARM",
        "catalogNumber": "657",
        "title": "Substance Use in Primary and Community Care",
        "descriptionAbbreviated": "Substance Use Prim & Comm Care",
        "description": "Mental health and addictions work is often carried out in specialized settings, focused on pathological substance use and use disorder. Addictions research is also almost entirely dedicated to substance use disorder and treatment. This course if focused on understanding substance use and addiction in community-based settings that are not necessarily addictions-focused. This course focuses on substance use in any form and how it affects health, public health, disease progression, and pharmaceutical care including drug interactions. We identify traditional and emerging types of research and information, including data from non-medical research sources and the grey literature. Community engagement and how to effectively educate policy makers, decision makers, stakeholders, service providers, and the public will be explored. Drug and drug classes covered include opioids, methamphetamine, cocaine, prescription and other stimulants, GABAergic drugs, serotonergic, glutamatergic, and cholinergic hallucinogens, entactogens, alcohol, nicotine, and cannabis.",
        "gradingBasis": "NUM",
        "courseComponentCode": "DIS",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    }
]