[
    {
        "courseId": "016829",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "ENGDEAN",
        "subjectCode": "BME",
        "catalogNumber": "601",
        "title": "Physiological Systems and Biomedical Design",
        "descriptionAbbreviated": "Physiol Systms & Biomed Design",
        "description": "This course surveys the anatomy and physiology of the human body at the cellular, organ and whole-body scale, from a systems biology/physiology perspective. Cell biology and some of the physiological systems (e.g., musculoskeletal, cardiovascular, pulmonary, digestive, renal, nervous and sensory, and immune) and their integration/interactions will be introduced from a quantitative systems perspective. Where applicable, common sources of impairments of each system (e.g., pathologies, aging, etc.) will be presented along with implications for diagnostic, therapeutic and rehabilitative technologies (and universal design). Students will be required to perform engineering design that applies their knowledge in biology and physiology that they have gained throughout the course.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016830",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "ENGDEAN",
        "subjectCode": "BME",
        "catalogNumber": "602",
        "title": "Foundations in Biomechanical Engineering",
        "descriptionAbbreviated": "Foundations Biomechanical Eng",
        "description": "This course focuses on equipping students with foundational knowledge in the biomechanics of human physiology, pathology, and treatment. The overarching aim of this course is to develop students' literacy in applying biomechanics principles and modern tools towards understanding the human body. The course will build on existing knowledge in mathematics and physics to develop new expertise and hands-on experience in the biomechanical modeling and analysis of physiological systems.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016831",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "ENGDEAN",
        "subjectCode": "BME",
        "catalogNumber": "603",
        "title": "Engineering Analysis of Living Cells",
        "descriptionAbbreviated": "Eng Analysis of Living Cells",
        "description": "Cell biology has reached a stage where it is in dire need of quantitative understanding. The vast amount of data gathered with the advance of experimental technologies, in the search for a general understanding of the complex cell mechanism at the molecular level, have often made the traditional way of direct interpretation impossible. Therefore, recent years have seen significant efforts made to understand these data with more sophisticated mathematical models, using fundamental physical laws and engineering analytic techniques. This course is an introduction to some of the successful achievements of these approaches, and the exciting potential outcomes of this line of research.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    }
]