[
  {
    "courseId": "014190",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "609R",
    "title": "Clinical Practice in Mental Health and Addictions",
    "descriptionAbbreviated": "Mental Health and Addictions",
    "description": "This course aims to equip students to provide sensitive and effective help to clients by presenting material concerning a range of mental health problems, assessment and treatment. The course considers clinical social work approaches across the continuum of mental health and addiction. Attention is focused on how social workers assess, document, support and intervene with consideration of the client, their family and social environment. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014191",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "601R",
    "title": "Health Policy",
    "descriptionAbbreviated": "Health Policy",
    "description": "This course offers critical analysis of health policy formulation, implementation, and evaluation related to population health initiatives and health care delivery.  The course includes discussion of the role of various regional, provincial, and national agencies in health care policy formation.  It examines various health care systems, and their funding as well as investigates how the Canadian healthcare system compares with systems in other countries.  (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014192",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "600R",
    "title": "Health, Equity, and Social Justice",
    "descriptionAbbreviated": "Health and Social Justice",
    "description": "This course explores health inequity within a Canadian context. It engages critical debates on key concepts related to health inequity including diversity, equity, access, and inclusion. The ultimate goal of this examination is to support students understanding of the social and structural determinants of health and the ways in which uneven access to these determinants are implicated in health inequities for equity-seeking groups, and consequently, social injustice. The course centers the learner as a pivotal agent in changing social structures that sustain health inequities. (Note: This is an intensive on campus course with an\nonline component).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014193",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "602R",
    "title": "Social Work Practice in Health",
    "descriptionAbbreviated": "Social Work Practice in Health",
    "description": "This course examines practice models and multi-level methods of intervention for effective social work practice in health care, including health promotion, disease prevention, assessment treatment, rehabilitation, continuing care, and discharge planning within the context of social, economic, environmental, and cultural variations. The distribution and determinants, as well as psychological and behavioural aspects of health and disease across the life span are addressed. Practice models incorporate competence and empowerment as central themes. Different practice models of care are explored within the context of socio-cultural factors that inform health and well-being. Differences between the concepts of illness and disease are explored within the healthcare narrative. Resource allocation in the management of chronic and complex health conditions is examined, and interventions that support individual and family capacity to adapt to health crises or chronic health conditions are considered.\n(Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014194",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "603R",
    "title": "Social Work Leadership in Health Care",
    "descriptionAbbreviated": "Social Work Leadership",
    "description": "This course examines the theories and practice skills of effective social work leadership within health care contexts, social service organizations, and community service delivery systems. The effective and responsible use of human and material resources are emphasized through a social justice lens, while knowledge and skills for ethical and value-based leadership in staff management and organizational change processes, coordination of inter-professional teams, creating a positive organizational culture, and policies to address the social determinants of health are addressed. Supervision will be examined as one form of leadership, where functions and skills of supervisory practice and the organizational contexts will be considered. Learners will be invited to critically examine and expand their own leadership style and skills via an inquiry-based approach, while developing foundational knowledge and skills for best practices in organizations. Development of styles of leadership, management and supervision that are respectful, reflective, and relational in nature are encouraged. (Note: This is an intensive on campus course with an online component).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014195",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "604R",
    "title": "Evaluation of Health and Human Service Programs",
    "descriptionAbbreviated": "Eval of Hlth & Human Serv Prog",
    "description": "This course introduces students to theoretical and practical aspects of program evaluation.  Students learn about the application of data collection skills to all phases of developing a health or human services program or service innovation, from needs assessment to analysis of findings to implementation of changes based on results.  Students learn to appreciate how these skills can be used as practical tools for identifying health and human services problems, for developing and implementing programs including taking a reflective practice approach, ensuring equity and fairness in program delivery (i.e., combating disparities), and generally promoting health and human services through effective and efficient programming.  (Note:  This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014196",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "605R",
    "title": "Knowledge Mobilization and Evidence-Based Practice",
    "descriptionAbbreviated": "Knowledge Mobilization & Pract",
    "description": "The goal of knowledge mobilization is to make research in health and social science more useful to policy, practice, and the public.  In this course students can learn how to gather, evaluate, synthesize and summarize scholarly knowledge in ways that meet the needs, timeframes, cultures, and realities of stakeholders. Activities include framing academic research in the context of public issues and creating knowledge products for practitioners and policy-makers in the students' areas of interest.  (Note:  This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014210",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "608R",
    "title": "Health Issues and Ethics",
    "descriptionAbbreviated": "Health Issues and Ethics",
    "description": "This course considers the nature of health itself, and explores the complexities of a health care system that corresponds with social work values and ethics while remaining sustainable. Three related themes serve as substrates for the semester: the nature of health, delivery of health care, and specific health experiences that are characterized by inequity, societal change, and/or a\nparticular ethical dilemma. Issues such as how health and illness are defined, cultural safety, the roles of preventive and curative approaches, and the impacts and ethics of new technologies and societal change will be addressed. The course critiques public, private, and individualized models of health, focuses on community health care, and examines the particular challenges of marginalized communities. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014653",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "650R",
    "title": "Interprofessional Psychosocial Oncology: Introduction to Theory and Practice",
    "descriptionAbbreviated": "Intro Psychosocial Oncology",
    "description": "This elective course provides graduate students with an introduction to the field of psychosocial oncology.  Emphasis will be placed on understanding and interpreting the experience of cancer informed by theory, evidence and illness narratives. Case based learning in small interprofessional groups will allow students to explore a variety of key learning themes relevant to psychosocial oncology including distress assessment, depression, anxiety, adjustment and coping, sexuality, loss and grief. Small group work will allow students to develop a rich understanding of the cancer experience and competency in psychosocial oncology assessment, interprofessional collaboration, and cultural safety. Attention to diversity will be integrated throughout the course.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014654",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "651R",
    "title": "Relational Practice with Families",
    "descriptionAbbreviated": "Relational Practice w/Families",
    "description": "Using case based learning in small interprofessional groups, students will explore a variety of key learning themes relevant to the interprofessional care of families. Themes that will be addressed include: family theory, models of family & couple counseling (particularly from a systemic and strengths based perspective), family assessment, therapeutic conversations and interventions. Case examples will be drawn from the experience of families across the cancer illness trajectory, from diagnosis through to death and dying, bereavement and long term survivorship. Small group work will allow student to develop a rich understanding of the cancer experience from the perspective of families, as well as competency in family assessment, intervention, interprofessional collaboration, and cultural safety. Attention to diversity will be integrated throughout the course.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "I",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014655",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "652R",
    "title": "Sexual Health & Counseling in Cancer",
    "descriptionAbbreviated": "Sexual Hlth & Counselg Cancer",
    "description": "Cancer causes wide-ranging impacts on sexual health and well-being and numerous studies have identified that people affected by cancer want support, education and counseling in this area. While health professionals consistently acknowledge that sexuality is within their scope of practice, few health professionals consistently assess or intervene in sexual health problems in cancer settings. This course is designed to provide graduate students in the health professions with the knowledge and skills to intervene with the sexual problems that arise in cancer.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "014724",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "690R",
    "title": "Special Topics in Social Work",
    "descriptionAbbreviated": "Special Topics in Social Work",
    "description": "",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "014725",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "672R",
    "title": "International Experience",
    "descriptionAbbreviated": "International Experience",
    "description": "This course provides students with an international learning experience, including a framework for understanding a developing country through a comparative study with Canada. The collective responses of citizens in meeting community needs in the context of colonial legacies and contemporary global influences are highlighted in both settings. The international learning experience usually takes place over 9 days and 3-4 additional days of pre- and post-trip learning. (Note: This is international experience with an on campus component).",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "015169",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "653R",
    "title": "Grief and Palliative Care in Social Work",
    "descriptionAbbreviated": "Grief & Palliative Care in SW",
    "description": "Grief is a part of the human experience that often occurs when a person dies. Social workers should be familiar with the concept for all aspects of practice. Palliative care is a model of health care for people with terminal illnesses, along with their families, in order to relieve suffering and improve quality of life. Palliative care is delivered by an interprofessional team which is most often comprised of medicine, nursing, social work and chaplaincy; other professions are often involved such as pharmacy, occupational therapy and others. This course addresses the social work role in grief and palliative care. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Masters Students"
  },
  {
    "courseId": "015357",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "610R",
    "title": "Interprofessional Approaches to Substance Use and Misuse and Mental Health",
    "descriptionAbbreviated": "Substance Use & Misuse and MH",
    "description": "This course serves as an overview of addiction, chemical abuse and chemical dependency and how social workers and pharmacists can independently or as a member of an interprofessional health team impact those affected. Topics include prevention, identification, treatment options, clinical aspects of treatment, and an understanding of support systems available for those in recovery. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Masters Students Only; Antireq:SWK 609R"
  },
  {
    "courseId": "016294",
    "courseOfferNumber": 2,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "654R",
    "title": "Indigenous Wellbeing, Health, and Social Justice",
    "descriptionAbbreviated": "Indigenous Wellbeing",
    "description": "This interdisciplinary course is intended to engage and advance knowledge and practice in Indigenous wellbeing and health through a social justice lens. The course critically links determinants of Indigenous Peoples wellbeing and health to historical and ongoing colonial priorities and practices. Disparities in health and social issues, access to care, and systemic challenges, including racism experienced by Indigenous Peoples in different regions and contexts, are shared as points for discussion and reflection. An intersectionality lens is applied in consideration of the unique wellbeing and health experiences among Indigenous Peoples, including Indigenous women, youth, and Two Spirit Peoples. Indigenous approaches to science, healing, and community-based ethical practices are also profiled in social work and health care delivery, research, policy, and programming. The knowledges, values, and perspectives of Indigenous Peoples are highlighted throughout this course, incorporated within a variety of resources including readings, film and other arts-based narratives that include Indigenous scholars and community activists, in the delivery of course content and assignments. This course was created in consultation with a local Indigenous Advisory Circle that included community-based Indigenous Elders, health leaders, social workers, and academics involved in Indigenous initiatives and research. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016429",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "606R",
    "title": "Advanced Social Work Research",
    "descriptionAbbreviated": "Advanced Social Work Research",
    "description": "The goal of this course is to deepen students' knowledge of the ways in which research can be produced, used, and disseminated in social work practice. The course will address research ethics, theories, and methods, and examine how different approaches can influence relationships and practices across community and health care settings. Students will develop their abilities to assess existing research studies, and will explore how they can engage in new research as social workers. Activities include literature reviews, interviews, surveys, and knowledge dissemination strategies. Particular attention will be paid to program evaluation and knowledge mobilization, and to how these may be used to improve services and further social justice in students' own organizations and communities. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  },
  {
    "courseId": "016430",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "AHSDEAN",
    "subjectCode": "SWK",
    "catalogNumber": "680R",
    "title": "Critical Topics in Social Work and Health",
    "descriptionAbbreviated": "Critical Topics SW and Health",
    "description": "This is a multi-module course that introduces students to key topics in social work and health through a critical lens (e.g., gerontology, mental health, community health, etc.). Students have the option of choosing 3 modules (topics), each being 4-weeks in duration. The common theme across the modules is the critical theories that frame the examination of each module topic. Students will further develop understanding of critical theoretical frameworks and their application to contemporary health discourses and health services and systems. Each module will underscore how the critical framing of health discourses and health services and systems are engaged as a method of identifying and responding to health inequities and diverse understandings of health and illness. (Note: This is an online course).",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "SWK Master's Students"
  }
]