[
  {
    "courseId": "013140",
    "courseOfferNumber": 2,
    "termCode": "1251",
    "termName": "Winter 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "HLTHGERON",
    "subjectCode": "HSG",
    "catalogNumber": "731",
    "title": "Approaches to Research in Work and Health",
    "descriptionAbbreviated": "Research in Work and Health",
    "description": "The purpose of this course is to introduce students to different ways of designing and implementing research within the topic area of work and health as well as some of the practical, political and ethical challenges.  The course content will include an examination of the epistemological positions associated with different types of research questions, analysis of case studies of research in work and health, and discussions of proposed research questions and proposals that examine problems from a variety of disciplinary perspectives.  The course will also include presentations by researchers and practitioners from the work and health domain, who will facilitate discussions on the challenges and opportunities of conducting and applying research in this area.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "013141",
    "courseOfferNumber": 2,
    "termCode": "1251",
    "termName": "Winter 2025",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "AHS",
    "associatedAcademicOrgCode": "HLTHGERON",
    "subjectCode": "HSG",
    "catalogNumber": "732A",
    "title": "Work and Health Research Seminar (I)",
    "descriptionAbbreviated": "Work & Health Research Sem (I)",
    "description": "This seminar is a forum for student presentations about results of or proposals for research.  Invited speakers will also present results of research from time to time.  Attendance at the seminar is required for two terms (i.e., during the candidates' first two years in the program).  Attendance beyond that is encouraged.  The range of topics that will be addressed in the seminar crosses all areas of investigation in the collaborative program.  Grading will be on a credit/no credit basis.",
    "gradingBasis": "CNC",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]