[
  {
    "courseId": "016614",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STP",
    "associatedAcademicOrgCode": "STP",
    "subjectCode": "INNOV",
    "catalogNumber": "311",
    "title": "Research for Social Impact",
    "descriptionAbbreviated": "Research for Social Impact",
    "description": "This course will build on the theory and skills gained in the prior INNOV courses. It will focus on the first of two initial stages in social innovation development, namely researching, understanding, and defining a particular problem. This will be accomplished by facilitating a deeper engagement with immersive social research and analysis skills, through experiential field visits and team-based active learning class-based exercises. The goal of this course will be to provide a coherent and credible basis to develop a social innovation-based initiative in INNOV411.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: INNOV 300 or INNOV 302"
  },
  {
    "courseId": "016616",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STP",
    "associatedAcademicOrgCode": "STP",
    "subjectCode": "INNOV",
    "catalogNumber": "300",
    "title": "Case Studies in Social Innovation for Impact",
    "descriptionAbbreviated": "Social Innovation Case Studies",
    "description": "This course will introduce students to the process of researching and responding to social innovation challenges. To facilitate this learning, students will draw from a rich range of social innovation case studies and projects generated by the GreenHouse social incubator over the last decade. They will also draw from the broader secondary literature, to understand how social innovation opportunities are framed and operationalized in response to these challenges. Students will hear directly from GreenHouse alumni who will present on their initiatives. They will also have opportunities to visit and interact with a cohort of GreenHouse students creating their own social impact initiatives.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: INNOV 200 or INNOV 201"
  },
  {
    "courseId": "016618",
    "courseOfferNumber": 1,
    "termCode": "1259",
    "termName": "Fall 2025",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "STP",
    "associatedAcademicOrgCode": "STP",
    "subjectCode": "INNOV",
    "catalogNumber": "200",
    "title": "Theory and Practice of Social Innovation and Impact",
    "descriptionAbbreviated": "Social Innovation Theory",
    "description": "This course will introduce students to foundational concepts and methods in social innovation and impact. Social innovation constitutes a range of activities across the world that seek to achieve lasting and positive social change at the systemic level. Students will engage in a series of classroom-based lectures, active learning exercises, and occasional experiential field visits to develop an understanding of how problems are identified and the unique response to such problems provided by the social innovation approach. Students will test out this knowledge by engaging in a team-based project that will apply what they have learned in the course to a particular problem that will be defined for them. Throughout the course, students will be given opportunities to develop their identities as change-makers, rather than knowledge-takers.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  }
]