[
    {
        "courseId": "012163",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "701",
        "title": "Engineering Risk and Reliability Analysis",
        "descriptionAbbreviated": "Risk and Reliability",
        "description": "This course gives a broad treatment of the subject of engineering decision, risk, and reliability.  Emphasis is on (1) the modelling of engineering problems and evaluation of system performance under conditions of uncertainty; (2) systematic development of design criteria, explicitly taking into account the significance of uncertainty; and (3) logical framework for risk assessment and risk-benefit tradeoffs in decision making.  The necessary mathematical concepts are developed in the context of engineering problems.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "012297",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "802",
        "title": "Reactor Physics",
        "descriptionAbbreviated": "Reactor Physics",
        "description": "An introduction to nuclear energy and fission energy systems is presented. The energetics of nuclear reactions, interactions of radiation with matter, radioactivity, design and operating principles of fission are presented. Nuclear reactor physics including chain reactions, reactor statics and kinetics, multigroup analysis, core thermalhydraulics and the impact of these topics on reactor design are covered. Special topics such as xenon dynamics, burnup and reactor flux effects on safety are included.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016935",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "601",
        "title": "Control, Instrumentation and Electrical Systems",
        "descriptionAbbreviated": "Ctrl, Instr & Elect Systems",
        "description": "This course covers the basic control, instrumentation and electrical systems commonly found in CANDU based nuclear power plants. The course starts with an overall view of the dynamics associated with different parts of the plant, i.e. reactor, heat transport systems, moderator, steam generator, turbine, and electrical generator. Based on such knowledge, the control and regulation functions in the above systems are then defined. Different instrumentation and measurement techniques are examined, along with control strategies. The time and frequency domain performance characterizations of control loops are introduced with consideration of actuator and sensor limitations. Different controller design and tuning methods and instrumentation calibration procedures are discussed. Two modes of operation of CANDU plants will be analyzed, i.e. normal mode and alternate mode. Advanced control technologies, such as distributed control systems, Field bus communication protocols are introduced in view of their potential applications in the existing and newly constructed CANDU power plants. The electric systems in the CANDU plant will be examined. The modeling of the dynamics and control devices for the generator will be covered in details. The dynamic interaction between the CANDU power plants and the rest of the electric power grid with other generating facilities and various types of load will be studied.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016936",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "602",
        "title": "Nuclear Fuel Waste Management",
        "descriptionAbbreviated": "Nuclear Fuel Waste Mgmt",
        "description": "This course will examine the sources and management approaches to storage and disposal of various nuclear wastes with focus on spent fuel waste generated primarily from nuclear reactors, in particular CANDU reactor. Key components of waste management approaches include waste characterization, classification, processing, packaging, transportation, storage and final disposal of the waste in a suitable repository. The first part of the course will examine detailed approaches including regulatory framework to manage low-level and intermediate-level radioactive wastes and wastes from Naturally Occurring Radioactive Materials. In the second half of the course, detailed considerations will be given to high-level radioactive spent nuclear fuel wastes. Presently, nuclear fuel waste management involves storage in water pools or dry storage containers at reactor sites. If the spent fuel is defined as waste, then permanent disposal at an appropriate deep geological site would be considered. The possible permanent disposal scenarios developed internationally will be discussed, with a primary emphasis on those potentially applicable in Canada. For this last topic, the design and fabrication of waste containers and the processes that could potentially lead to their failure, the properties of engineered barriers within the geological site, the essential geological features of the chosen site, and the computational modeling approaches used in site performance assessment calculations will be described. International experiences on regulatory and Community issues, resolutions, and examples of operating and planned nuclear waste storage and disposal facilities will be detailed. The course will also present through examples tools to arrive at preferred management options for selected non-fuel waste effluents.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016937",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "603",
        "title": "Project Management for Nuclear Engineers",
        "descriptionAbbreviated": "Proj Mgmt - Nuclear Engineers",
        "description": "Project Management is emerging as perhaps the key core competency in engineering in the 21st century industrial workplace. This course in Project Management will prepare nuclear engineers in the application of this discipline in their work. It is an intensive investigation into the major principles of Project Management slanted towards, but not exclusively about, the management of nuclear engineering projects. The course uses the Project Management Institute¿s PMBOK (Project Management Body of Knowledge) as a skeleton and expands that coverage with relevant examples from nuclear, software and general engineering. Special emphasis will be placed on Risk Management, particularly in the area of safety-critical projects. The graduate will be well-positioned both to apply the knowledge in their area of engineering and to sit the PMI¿s PMP examination. The course will be taught by a professional engineer holding the PMP certification, using many case studies from industry and engineering.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016938",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "803",
        "title": "Nuclear Reactor Safety Design",
        "descriptionAbbreviated": "Nuclear Reactor Safety Design",
        "description": "This course covers safety design and analysis of nuclear reactors based on deterministic and probabilistic assessments. Topics include: nuclear safety principles, concepts of risk; probability tools and techniques; safety criteria; design basis accidents and other accidents; risk assessment; deterministic safety analysis; probabilistic safety assessments; regulatory requirements, safety system design; severe accidents; operational safety of reactors; and general policy and principles. Examples will be drawn from CANDU-6 and multi-unit CANDU designs, with limited discussion of Light Water Reactors (e.g., BWRX-300).",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016939",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "804",
        "title": "Nuclear Reactor Heat Transport System Design",
        "descriptionAbbreviated": "Nuclear Heat Trans Syst Design",
        "description": "This course covers the topic of thermalhydraulics design and operation of nuclear power reactors. It includes an overview of nuclear reactor systems, thermalhydraulic design requirements, limits, and margins, and thermalhydraulic phenomena related to reactor safety. The course covers the conservation equations and equation of state and applies them to describe single and two-phase flow and heat transfer in the reactor core and other reactor systems. The course describes and explains the energy conversion processes in the reactor core and other elements of the reactor heat transport systems. Also, the course provides information about the pressure drop and other thermalhydraulics parameters and phenomena in the reactor heat transport system. The course discusses the design, role, and functionality of various thermalhydraulics systems and components.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016940",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "805",
        "title": "Introduction to Operational Health Physics",
        "descriptionAbbreviated": "Intro Operational Hlth Physics",
        "description": "An introduction to a number of topics that will be encountered in the practice of health physics. The following topics will be discussed: Dose limitation; dosimetric quantities for individuals and populations; ionizing radiation risks and hazards; ICRP-60; internal doses and the compartment model; derived air concentrations and annual limit on intake; metabolic models for respiratory system and GI tract, radiation safety at nuclear reactors, particle accelerators, irradiators, X-Ray installations and laboratories; pathway analysis; derived release limits; environmental monitoring, sample collection and preparation, and sources of radiation; atmospheric transport; cost-benefit analysis; derivation of limits for surface contamination.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016941",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "806",
        "title": "Nuclear Fuel Engineering",
        "descriptionAbbreviated": "Nuclear Fuel Engineering",
        "description": "This course covers power reactor fuel design, performance, and safety aspects, and complements other Engineering Physics / UNENE courses on reactor core design, thermohydraulics and reactor safety design. It includes fissile and fertile fuels; burnup effects; fuel production (as well as uranium enrichment and reprocessing of spent fuel), quality assurance and CANDU fuel technical specifications; thermal conductivity; fuel chemistry; fuel restructuring and grain growth; fission product behaviour; fuel defect detection and location; fuel performance in operation; and fuel / fuel channel behaviour in design basis and severe accidents.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016942",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "807",
        "title": "Power Plant Thermodynamics",
        "descriptionAbbreviated": "Power Plant Thermodynamics",
        "description": "Theoretical and practical analysis of the following with particular reference to CANDU plants. Thermodynamic Cycles: Nuclear versus conventional steam cycles, regenerative feedwater heating, moisture separation and reheating, turbine expansion lines, heat balance diagrams, available energy, cycle efficiency and energy analysis. Nuclear Heat Removal: Heat conduction and convection in fuel rods and heat exchanger tubes, heat transfer in boilers and condensers, boiler influence on heat transport system, boiler swelling and shrinking, boiler level control, condenser performance. Steam Turbine Operation: Turbine configuration, impulse and reaction blading, blade velocity diagrams, turbine seals and sealing systems, moisture in turbines, part load operation, back pressure effects, thermal effects and turbine governing.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016943",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "808",
        "title": "Reactor Chemistry and Corrosion",
        "descriptionAbbreviated": "Reactor Chemistry & Corrosion",
        "description": "Corrosion and its costs, corrosion measurement, general materials and environment affects. Types of corrosion: uniform, galvanic, crevice, pitting, intergranular, selective leaching, erosion-corrosion, stress-corrosion, hydrogen effects. Corrosion testing: materials selection. Electrochemical principles: thermodynamics, electrode kinetics, mixed potentials, practical applications. High temperature corrosion. Nuclear plant corrosion, fossil plant corrosion, other industrial environments.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016944",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "901",
        "title": "Nuclear Materials",
        "descriptionAbbreviated": "Nuclear Materials",
        "description": "A nuclear reactor presents a unique environment in which materials must perform. In addition to the high temperatures and stresses to which materials are subjected in conventional applications, nuclear materials are subjected to various kinds of radiation which affect their performance, and often this dictates a requirement for a unique property (for example, a low cross section for thermal neutron absorption) that is not relevant in conventional applications. The effects of the radiation may be direct (e.g., the displacement of atoms from their normal positions by fast neutrons or fission fragments), or indirect (e.g., a more aggressive chemical environment caused by radiolytic decomposition). This course describes materials typically used in nuclear environments, the unique conditions to which they are subjected, the basic physical phenomena that affect their performance and the resulting design criteria for reactor components made from these materials.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016976",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "751",
        "title": "Nuclear Fuel Management",
        "descriptionAbbreviated": "Nuclear Fuel Management",
        "description": "Topics covered include: Uranium mining and processing for use in nuclear reactors, uranium tails and mass of natural uranium required for enrichment to various levels, reactivity curve of fuel and its importance, the refueling process in CANDU, design and capabilities of the fueling machine, significance of flux/power shape in reactor, how and why to flatten the flux distribution (adjuster rods, differential fueling), time-average, snapshot, and core-follow models for CANDU reactors, PWR fuel management. Significant hands-on projects for CANDU reactors, with full-core diffusion codes and models. Carrying out actual core-follow calculations in CANDU and selection of channels for refueling.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016977",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "752",
        "title": "Nuclear Power Plant Systems and Operations",
        "descriptionAbbreviated": "Nuclear Power Plant Sys & Op",
        "description": "System and overall unit operations relevant to nuclear power plants with emphasis on CANDU; includes all major reactor and process systems with nuclear plant simulator; self-study using interactive CD ROM. The course is organized into chapters and modules. Each chapter encompasses a major portion of a CANDU Nuclear Power Plant, and each module covers a system or a group of functionally related systems. Note, other technologies may be discussed throughout the course.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016979",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "753",
        "title": "Nuclear Energy in Society: Regulations and Energy Future",
        "descriptionAbbreviated": "Nucl EN in Soc: Regs & EN Fut",
        "description": "This course covers the nuclear regulations in Canada and provides information on the international nuclear regulatory obligations. The course describes the content and process for obtaining construction and operating licences for nuclear installations. Also, the course describes the objective and content of the Licence Condition Handbook. The course describes the most important CNSC guide and regulatory documents and their implementation in the industry. Also, the course covers the compliance and regulatory reporting.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "016980",
        "courseOfferNumber": 1,
        "termCode": "1255",
        "termName": "Spring 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENG",
        "associatedAcademicOrgCode": "CIVE",
        "subjectCode": "UN",
        "catalogNumber": "754",
        "title": "Small Modular Reactors",
        "descriptionAbbreviated": "Small Modular Reactors",
        "description": "The course describes the role of the Small Modular Reactors (SMRs) in electricity generation and for special applications in developed and developing countries. Selected types of SMRs that are relevant and considered for implementation in Canada are described in the course. The course covers the most important design features of selected SMR reactors in each group. The course summarizes the physics, thermal hydraulics, fuel and safety characteristics of the selected SMR designs. Comparison of safety improvements, inherent and passive safety features, and reactor safety margins for different SMR designs are included.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "D",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    }
]