[
  {
    "courseId": "008896",
    "courseOfferNumber": 1,
    "termCode": "1219",
    "termName": "Fall 2021",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "VPA",
    "associatedAcademicOrgCode": "STV",
    "subjectCode": "STV",
    "catalogNumber": "100",
    "title": "Society, Technology and Values: Introduction",
    "descriptionAbbreviated": "Society, Tech & Values: Intro",
    "description": "This course examines the interaction of the technologies developed by a culture with the values and social organization of that culture. The course exposes students to various definitions of society, technology and values, and it presents alternative views about how the three interact. These views are then applied to a number of spheres of influence, including patterns of employment and the role of work; medicine and health; polity and economy; sustainable development and the environment.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "008905",
    "courseOfferNumber": 1,
    "termCode": "1219",
    "termName": "Fall 2021",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "VPA",
    "associatedAcademicOrgCode": "STV",
    "subjectCode": "STV",
    "catalogNumber": "202",
    "title": "Design and Society",
    "descriptionAbbreviated": "Design and Society",
    "description": "The course uses design as a vehicle for examining technology and society interaction, particularly how we design, create, and choose technology. Design and Society has been created to introduce students to various methods to help them view design and technology from a technology-society perspective. The overriding aims of the course are to (a) develop an ability to see through the eyes of others and promote thinking about technology in terms of users as well as producers or creators, (b) develop critical thinking skills, and (c) present design and the choice of technology as an activity involving societal and individual concerns rather than as a purely technical matter. The course does not require advanced technical knowledge and is open to students of all faculties.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Antireq: SYDE 261"
  },
  {
    "courseId": "008906",
    "courseOfferNumber": 1,
    "termCode": "1219",
    "termName": "Fall 2021",
    "associatedAcademicCareer": "UG",
    "associatedAcademicGroupCode": "VPA",
    "associatedAcademicOrgCode": "STV",
    "subjectCode": "STV",
    "catalogNumber": "306",
    "title": "Biotechnology and Society",
    "descriptionAbbreviated": "Biotechnology and Society",
    "description": "Biotechnologies are currently migrating from the laboratory to a wide range of consumer products. In everything from foods to pharmaceuticals, genetic engineering is entering daily life. The biotechnology revolution will likely have as much of an impact on our lives as the information technology revolution. However, there is a wide and potentially dangerous gap between research and development on the one hand and societal awareness of its impact on the other. This course is intended to help students gain a deeper appreciation for the issues, including ethics, surrounding biotechnology and society. It will do this through an investigation of such interactions between biotechnologies and society as genetics and the law, foods and the media, and soil remediation and the environment. Consideration will also be given to the role of computing in biotech research and in the human genome project.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: Level at least 3A or any 100- or 200-level STV course"
  }
]