[
  {
    "courseId": "016628",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "600",
    "title": "Systems, Synergy, Collaboration",
    "descriptionAbbreviated": "Systems, Synergy, Collaboratio",
    "description": "This intensive block course sets the groundwork for students to understand the systemic nature of urban challenges, the complex reality of leading change in volatile circumstances and the power of collaborative engagement to build a sustainable future. Through practice-based learning, students will identify leverage points for change-making as they build their capacity for distributed knowledge and action. They will also\ndevelop professional skills required to lead collaborative teams in the context of designing and implementing urban sustainability initiatives. The course is delivered in modules focusing on systems analysis, problem identification in uncertain futures, team collaboration, as well as effective virtual and live engagement and participation processes. Students will build their knowledge of the characteristics of effective strategic decision making in multi-stakeholder contexts.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "MFC Grad Students"
  },
  {
    "courseId": "016629",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "601",
    "title": "Tools for Futures Thinking",
    "descriptionAbbreviated": "Tools for Futures Thinking",
    "description": "Through theory and practice, this progressive project-based course will introduce foresight methods used in the development of strategic proposals related to urban sustainability. Working in teams, students will identify an issue in a specific predefined sector. Their exploration and research begins with a divergent process of signal discovery of emerging issues and trends through methods such as environmental scanning, new technology research, user research, field study, or stakeholder workshops. In a subsequent convergent process, students will then learn and apply methodologies, including medium-to long-range exploratory scenario planning, to develop insights and implications for action. A strategic innovation response will then be stress tested against scenarios to evaluate effectiveness and systemic fit for the defined urban context. Students will develop futures literacy skills to make sense of complex emergence and gain confidence in their ability to frame positive responses to change.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600; Master of Future Cities students only"
  },
  {
    "courseId": "016630",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "603",
    "title": "Sustainable Future Cities",
    "descriptionAbbreviated": "Sustainable Future Cities",
    "description": "Cities have become the sites of significant sustainability challenges. At the same time, cities represent important assets for catalyzing sustainable development. This course will explore the theories, policies, and actions that have guided cities toward more sustainable futures. This discussion will be framed using the tools provided by systems thinking and futures thinking.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600, 601; Master of Future Cities students only"
  },
  {
    "courseId": "016631",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "620",
    "title": "Future Cities Capstone Project",
    "descriptionAbbreviated": "Future Cities Capstone Project",
    "description": "Guided by faculty, students will work closely with an external partner to develop possible solutions to a specific urban sustainability problem in the form of a professional report. Partner organizations vary from not-for-profit, governmental, and private sector entities. Specifics may vary from year to year.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600, 601, 602, 603; Master of Future Cities students only"
  },
  {
    "courseId": "016632",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "602",
    "title": "Future Thinking and Cities",
    "descriptionAbbreviated": "Future Thinking and Cities",
    "description": "This course focuses on thinking about the future in ways that intersect with the urban phenomenon. It explores visions of the future, including the different objectives, impacts, potential, and limitations of these visions. This course looks at how visions of the future can inform human behaviour as people adapt to possible futures or, indeed, shape the future.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600; Master of Future Cities students only"
  },
  {
    "courseId": "016633",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "610",
    "title": "International Field School",
    "descriptionAbbreviated": "International Field School",
    "description": "Building on their learning in Systems and Futures thinking, students will travel to one or more cities that showcase leading-edge sustainability solutions and provide innovative, resilient strategies to prepare for a changing world. The site for the international field school will vary from year to year, but will be outside of Canada. FCIT 610 will have co-instructors ¿ one who is an expert in the futures space, the other may or may not have futures experience but will have lived experience in or familiarity with the destination city. Programming will include site visits, conversations with sustainable city leaders in different sectors (for example transportation, waste management, climate mitigation, housing, public health, food systems) and case study specific learning modules. Supplemental preparatory reference materials will position how the adoption of forward leaning approaches was achieved within specific contextual circumstances. The course is run as an intensive block course. Note: this course will include an additional field trip fee to cover the cost of travel and accommodation, the amount will vary depending on the location.",
    "gradingBasis": "NUM",
    "courseComponentCode": "FLD",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600, 601; Master of Future Cities students only"
  },
  {
    "courseId": "016634",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "607",
    "title": "Data, Methods, and Models for Future Cities",
    "descriptionAbbreviated": "Data, Methods, & Models",
    "description": "This course is a hands-on introduction to the challenges and opportunities of \"big data,\" computational power, and disruptive technologies (e.g., machine learning, artificial intelligence, and the internet of things) for future cities. It emphasizes contemporary debates about data ethics and politics, with an emphasis on privacy, surveillance, and security. Students will learn how to use Python to manage and analyze data; develop and interpret models; integrate domain experience and expertise from stakeholders; and effectively communicate evidence, risk, and uncertainty to decision-makers",
    "gradingBasis": "GRD",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: FCIT 600, 601; Master of Future Cities students only"
  },
  {
    "courseId": "016635",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "604",
    "title": "The Socially Just City",
    "descriptionAbbreviated": "The Socially Just City",
    "description": "This course explores efforts by urban planners, policy-makers and social movement organizations to envision and create socially just cities. Cities emerge through historical power relations, including contradictions between production (capital accumulation) and socio-ecological reproduction. They are places of hope, wealth accumulation, innovation and cultural vibrancy. But, as we will explore, cities are characterized by social struggles over: the uneven distribution of wealth and opportunities; a desire for deeper democratic participation; inequitable access to services and public space; unequal distribution of environmental benefits and harms; increasing state and corporate surveillance; philosophies and practices of security, policing and incarceration; and related discriminatory processes according to people¿s gender, sexuality, race and ethnicity, ability and (legal) status. We draw on case studies from cities around the world to critically assess progressive policies, programs and grassroots-led initiatives aimed at resolving these conflicts. This course focuses on solutions aimed at: increasing affordable housing and access to public transportation; redistributing wealth (e.g., through tax policy and public ownership); creating good jobs; planning for equity; and deepening participatory urban governance.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016636",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "609",
    "title": "Mobility Futures",
    "descriptionAbbreviated": "Mobility Futures",
    "description": "Taking a systems approach, this course focuses on exploratory mobility futures with an emphasis on personal transportation in urban areas. Technological innovation and transport automation and their interactions with socio-demographics, the nature of work, land use planning, and energy systems are used to develop scenarios of different plausible futures and for identifying the challenges and opportunities that may emerge.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": null
  },
  {
    "courseId": "016638",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "605",
    "title": "The Future of Work",
    "descriptionAbbreviated": "The Future of Work",
    "description": "This advanced graduate seminar examines the emergent possibilities associated with work in cities of the future. It theorizes the central role that work plays in everyday urban life, highlighting how work is spatially and socially unevenly distributed and how inequality continues to structure labor markets in cities. It engages with `future of work¿ discourses to examine the complex role of technological change in urban labor market transition, as well as questioning the prominence of technological change in such transition. It focuses both on sectors privileged by mainstream theories of urban development (e.g., high technology and the creative industries) and sectors ignored by such theories but that nevertheless remain essential for the functioning of urban centers, including unpaid, informal, and care work. It questions the  role of work in everyday life by highlighting dominant working norms and resistance to them, e.g., in calls for redistributive justice through unionization and collective action, anti-work discourses, and campaigns for a four-day work week.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: Master of Future Cities or Geography Graduate students only. Antireq: GEOG 693 topic 3"
  },
  {
    "courseId": "016639",
    "courseOfferNumber": 1,
    "termCode": "1245",
    "termName": "Spring 2024",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "ENV",
    "associatedAcademicOrgCode": "ENVDEAN",
    "subjectCode": "FCIT",
    "catalogNumber": "606",
    "title": "Sustainability Transitions in Cities",
    "descriptionAbbreviated": "Sustainability Transitions",
    "description": "Sustainability is a multi-faceted and ever-changing collection of aspirations that weaves together environmental integrity, economic prosperity and social equity. The transition to more sustainable cities is both fraught with challenges, including the legacy of unsustainable infrastructure and deeply entrenched habits, but also exciting opportunities and potential for innovation. In this course, we explore the challenge of urban sustainability transitions through a systems lens, exploring the technologies, governance models, values, and behaviours that might trigger and accelerate the transition. We look around the world for compelling examples of sustainability transitions in practice, from Malmö to Melbourne, and apply the lessons we learn to the Canadian context.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "N",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: Master of Future Cities or Master of Climate Change students only"
  }
]