[
  {
    "courseId": "014565",
    "courseOfferNumber": 1,
    "termCode": "1219",
    "termName": "Fall 2021",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "GRAD",
    "associatedAcademicOrgCode": "GRAD",
    "subjectCode": "WATER",
    "catalogNumber": "601",
    "title": "Integrated Water Management",
    "descriptionAbbreviated": "Integrated Water Management",
    "description": "This course provides an overview of current issues and challenges in water research and management from a variety of disciplines, including water science, engineering, governance and economics perspectives.  The purpose is to provide students with a broad knowledge base of the key theories, concepts and terminology from various water-related fields, and to allow them to develop connections with peers, water researchers and professionals in other areas of study. \n\nCase studies that demonstrate the complexity and opportunities for interdisciplinary water research and innovation, and that allow students to collaboratively explore ideas, will be examined.  Seminars, presentations and discussions with faculty members and professionals from different disciplines will introduce students to current research and practice.  Course readings will focus on key concepts, perspectives and terminology from multiple disciplines.",
    "gradingBasis": "NUM",
    "courseComponentCode": "LEC",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "WATER Grad Students only"
  },
  {
    "courseId": "014566",
    "courseOfferNumber": 1,
    "termCode": "1219",
    "termName": "Fall 2021",
    "associatedAcademicCareer": "GRD",
    "associatedAcademicGroupCode": "GRAD",
    "associatedAcademicOrgCode": "GRAD",
    "subjectCode": "WATER",
    "catalogNumber": "602",
    "title": "Integrated Water Management Project",
    "descriptionAbbreviated": "Integrated Water Project",
    "description": "This course builds on WATER 601 and focuses on the Grand River Watershed.  The course normally includes a six to eight day field trip held at the beginning of the term, followed by one or two seminar sessions during the first month of the term.  The field trip will allow students to examine specific watershed components, landscapes, infrastructure and conditions from interdisciplinary perspectives.  Students will travel across the watershed and meet water practitioners, managers, scientists, volunteers and others concerned with watershed health to learn first-hand about watershed issues and management approaches.\n\nBased on the interactive field trips and supporting materials, a multidisciplinary group project will be required where students identify an approach to investigating an emerging watershed issue.",
    "gradingBasis": "NUM",
    "courseComponentCode": "SEM",
    "enrollConsentCode": "D",
    "enrollConsentDescription": "No Consent Required",
    "dropConsentCode": "N",
    "dropConsentDescription": "No Consent Required",
    "requirementsDescription": "Prereq: WATER 601"
  }
]