[
    {
        "courseId": "013549",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "640",
        "title": "Strategies for Sustainable Enterprises",
        "descriptionAbbreviated": "Sustainable Enterprises",
        "description": "This course looks at organizational strategy through the \"lens\" of sustainability.  It explores how corporations (and other types of organizations) are realigning and in some cases reinventing their corporate strategies to move toward more sustainable business models.  This includes initiatives undertaken within the firms, as well as initiatives pursued outside the firm (such as through partnerships).  Several frameworks are offered for assessing the degree to which principles of sustainability are embraced within an organization's strategies.  In addition, tools for formulation and implementing a sustainability strategic plan are presented.  Case studies draw from different sectors and also different organizational types.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "013666",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "650",
        "title": "Environmental Finance",
        "descriptionAbbreviated": "Environmental Finance",
        "description": "Financial and accounting \"tools\" have potential to create effective and far-reaching market-based solutions to address a range of environmental problems, including climate change, deforestation, water issues and biodiversity loss, while at the same time identifying and securing new business opportunities for companies and their customers.  An increasing number of financial and accounting products and services have emerged to direct resources and lending power to mitigate ecological degradation and/or encourage sustainable practices and decision-making.  the course considers environmental finance products, tools and services; carbon finance an economics, and other approaches to environmental assets; international capital projects, structured financing, risk and sustainability in financial modeling; full-cost accounting; relation of sustainability performance to capital market valuation and financial performance; socially responsible investing; sector governance, disclosures, regulations, principles and codes.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "014599",
        "courseOfferNumber": 1,
        "termCode": "1251",
        "termName": "Winter 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "690A",
        "title": "Enterprise Sustainability Project",
        "descriptionAbbreviated": "MEB Capstone Projects",
        "description": "The capstone class synthesizes the learning in the program into a research project. Students show original application of the knowledge they have learned and reflect on the utility of the frameworks and tools using a case study approach. After learning relevant research methods, student teams develop a proposal on a research project which meets the needs of their live case study (i.e. the company or other organization which has committed to be the case in the research project). This proposal includes a review of the relevant literature, the methodology and project timeline. Where applicable, students obtain ethics approval for their research project. Each field study includes conducting a situation analysis, developing a sustainability strategic plan for the organization. A Faculty member assists each team. Students deliver field study project results as a report to both the organization and the course instructor. Individual students also complete a short reflection paper including a discussion of the case in relation to the application of sustainability frameworks and literature.",
        "gradingBasis": "CNC",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    }
]