[
    {
        "courseId": "013545",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "601",
        "title": "Business and the Case for Sustainability",
        "descriptionAbbreviated": "Bus. Case for Sustainability",
        "description": "This on-site intensive course introduces students to basic business concepts and integrates them with concerns for sustainability.  The underlying emphasis is on the value and rationale, opportunities and risks for businesses to undertake and integrate environmental and social sustainability initiatives.  Business topics to be covered include an introduction to concepts and terminology from finance,accounting, strategy, marketing, organization behaviour and operations.  Guests from academia, industry, governments, and non-profit organizations present topics and case studies.  Students also learn about the MEB program, meet faculty members, meet each other, and are introduced to distance education tools.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    },
    {
        "courseId": "013546",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "602",
        "title": "Introduction to Sustainability for Business",
        "descriptionAbbreviated": "Intro Business Sustainability",
        "description": "This course reviews the history of global environmentalism; societal expectations and business responses; and the emergence of corporate social and environmental responsibility.  It systematically presents environmental (climate change, air pollution, water quality and quantity, energy and resource consumption, etc.), and social (human rights, health, poverty, ethics, fair trade, etc.) issues, their science, status and priority; technological, regulatory and policy responses; and implications for business.  This course introduces concepts for business sustainability, including systems thinking, complexity and resilience, corporate responsibility, materials and energy flows and transformations, economic and market mechanisms, and relates these to business operations, marketing and strategic management.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Master of Environment and Business Students"
    },
    {
        "courseId": "013547",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "620",
        "title": "Business Operations and Sustainability",
        "descriptionAbbreviated": "Business Ops & Sustainability",
        "description": "This course examines environmental and sustainability management tools for business operations; it addresses process and product considerations.  These include environmental management system tools; cleaner production and pollution prevention tools (environmental risk management, environmental impact assessment, emissions quantification and verification, eco-efficiency, etc.); product stewardship and eco-design tools (design for environment, life cycle assessment/costing, greening supply chain, etc.); sustainability accounting tools (key performance indicators, ecological footpint, social balance, full cost accounting, etc.); and human resource tools (managing teams, motivating people for sustainability, diversity policies, etc.).  The sustainability tools are explained in relation to health/safety programs, human resources management, and operations and quality management.  The course draws on practices and illustrative examples of performance of organizations in different sectors, around different environmental issues (energy, waste, water, air emissions, etc.).",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "N",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": "Prereq: ENBUS 601 and 602; Master of Environment and Business Students"
    },
    {
        "courseId": "013554",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "632",
        "title": "Sustainability Reporting",
        "descriptionAbbreviated": "Sustainability Reporting",
        "description": "This course builds students' competencies in sustainability indicators, reporting and corporate accountability approaches for multinational corporations and other types of organizations.  The course examines global reporting standards for environmental, social and sustainability reporting that are relevant to all sectors of industry and society.  It covers the identification and roles of stakeholders certification and auditing expectations and procedures.  Content addresses materiality in sustainability reporting; regulatory context; legal implications; interrelations with financial accounting practices and standards.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    },
    {
        "courseId": "013556",
        "courseOfferNumber": 1,
        "termCode": "1259",
        "termName": "Fall 2025",
        "associatedAcademicCareer": "GRD",
        "associatedAcademicGroupCode": "ENV",
        "associatedAcademicOrgCode": "SEED",
        "subjectCode": "ENBUS",
        "catalogNumber": "642",
        "title": "Stakeholder Engagement, Collaborations and Partnerships",
        "descriptionAbbreviated": "Stakeholders, Collaborations",
        "description": "This course builds competences in the development and deployment of strategies and processes (in for-and not-for-profit organizations) to engage both internal and external stakeholders in opportunities to accelerate sustainability.  Content covers: the identification, characterization and valuation of primary and secondary stakeholders; drivers and challenges; engagement approaches, including traditional and social media forms of communication, consultation, conflict resolution, and cross-sector partnerships.  Content also introduces: structures, including informal vs. formal interactions, face-to-face and distance meetings, industry associations, joint ventures, public-private partnerships, networks and business to not-for-profit collaborations; processes, such as partnership formation, decision-making, monitoring of progress; and strategic considerations, such as business value, risk management, control vs. influence, barriers and confluence points.  Students working as a team will present their recommendations on a real time case study to stakeholders involved.",
        "gradingBasis": "NUM",
        "courseComponentCode": "LEC",
        "enrollConsentCode": "I",
        "enrollConsentDescription": "No Consent Required",
        "dropConsentCode": "N",
        "dropConsentDescription": "No Consent Required",
        "requirementsDescription": null
    }
]